[
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/236mwbxbxjfsvns4jan/236/236_hd_avspeechsynthesizer_making_ios_talk.mp4?dl=1", "title": "AVSpeechSynthesizer: Making iOS Talk", "summary": "Speech can enhance the audio experience of your app, whether you are generating spoken feedback for accessibility, or providing critical information beyond simple alerts or notifications. AVSpeechSynthesizer produces synthesized speech from text and allows you to control and monitor the progress of ongoing speech. Learn the ins and outs of AVSpeechSynthesizer and how to add computer-generated speech output to your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/405bjty1j94taqv8ii/405/405_hd_measuring_performance_using_logging.mp4?dl=1", "title": "Measuring Performance Using Logging", "summary": "Learn how to use signposts and logging to measure performance.  Understand how the Points of Interest instrument can be used to examine logged data. Get an introduction into creating and using custom instruments."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/411gl7b9ztm2imp/411/411_hd_getting_to_know_swift_package_manager.mp4?dl=1", "title": "Getting to Know Swift Package Manager", "summary": "The Swift Package Manager makes it possible to easily develop and distribute source code in the Swift ecosystem. Learn about its goals, design, unique features, and the opportunities it has for continued evolution."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/210y2fene7yk01/210/210_hd_introducing_dark_mode.mp4?dl=1", "title": "Introducing Dark Mode", "summary": "Hear from the Apple design team about the principles and concepts that anchor Dark Mode. Learn the basics of enhancing your app with this new appearance, and add an experience that people are sure to love."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/413mapolqk6ca7mozr/413/413_hd_create_your_own_swift_playgrounds_subscription.mp4?dl=1", "title": "Create Your Own Swift Playgrounds Subscription", "summary": "Swift Playgrounds is a revolutionary iPad app to teach coding with the powerful Swift programming language. Learn how to create your own content for Swift Playgrounds using the new template, and find out how to use the subscription format to host your own feed online for others to access."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/415o65ozc2l1bc3/415/415_hd_behind_the_scenes_of_the_xcode_build_process.mp4?dl=1", "title": "Behind the Scenes of the Xcode Build Process", "summary": "Ever wonder what happens when you build your project in Xcode? Learn how Xcode automates the steps required to build an application, and go behind the scenes to learn how clang, swiftc, and the linker work together to turn your source code into a working program."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/402ta235oio1spobfi/402/402_hd_getting_the_most_out_of_playgrounds_in_xcode.mp4?dl=1", "title": "Getting the Most out of Playgrounds in Xcode", "summary": "Discover major advancements in Xcode playgrounds. Learn advanced tips and techniques, hear about new and often overlooked workflows, and rediscover the tools provided when coding in playgrounds."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/223plbqb0sfpv80/223/223_hd_embracing_algorithms.mp4?dl=1", "title": "Embracing Algorithms", "summary": "When you imagine building a new app, what do you think about? Models, views, and controllers deserve their prominent place in the design process, but we don't often give the same attention to the underlying work our apps need to do. Understand how to identify and optimize the algorithms in your app, and discover how implementing algorithms as generic protocol extensions results in efficient, effective, and maintainable code."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/222krhixqaeggyrn33/222/222_hd_data_you_can_trust.mp4?dl=1", "title": "Data You Can Trust", "summary": "A lot can go wrong when loading data into your app. Whether you work directly with JSON and property lists, or with higher-level APIs such as NSCoding and Codable, learn how to defend your customers and secure your code against invalid or malicious data. Avoid fatal assumptions by validating payload structure, type information and domain correctness, to turn the data you work with into data you can trust."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/410naz8a8zy0rq9cg/410/410_hd_creating_custom_instruments.mp4?dl=1", "title": "Creating Custom Instruments", "summary": "Understand how custom instruments are useful and when they should be used. Get an in-depth view of the architecture of custom instruments and how to create them. Understand the attributes of a good instrument. Dive into advanced modeling and how to use the CLIPS language."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/408bhgyeffq8acmv/408/408_hd_building_faster_in_xcode.mp4?dl=1", "title": "Building Faster in Xcode", "summary": "Build your apps faster in Xcode 10. Learn how to structure your projects and tweak your code to take full advantage of all processor cores. Whether you've made a few small code changes you want to give a try, or you're building your full app for release, these techniques will cut the time it takes to build a running app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/224esqliuhnac9p11/224/224_hd_core_data_best_practices.mp4?dl=1", "title": "Core Data Best Practices", "summary": "As your app gains more customers and becomes more feature-rich, you may find yourself with new problems to solve. Core Data is a powerful tool that has changed a lot over the years. Learn about the new best practices in Core Data, such as how to use concurrency and persistent history, and discover how to test for, and resolve, common problems using familiar technologies."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/304o1mulfeyvd4wd/304/304_hd_whats_new_in_search_ads.mp4?dl=1", "title": "What's New in Search Ads", "summary": "Search Ads is a great way to help people discover your app in App Store search results. Learn how new market expansion will give you greater opportunities to reach high quality customers. See how Search Ads Advanced new creative variations will help make your app promotion even more effective."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/301k4gd0t7y955ppg/301/301_hd_whats_new_in_app_store_connect.mp4?dl=1", "title": "What's New in App Store Connect", "summary": "App Store Connect is constantly evolving to improve the experience of managing and deploying your app on App Store. Learn about the new App Store Connect API for managing frequently modified data such as users and groups, see the latest updates to Sales Trends and Analytics reporting, and TestFlight features enhanced to help you test and deploy your next masterpiece."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/412zw88j5aa4mr9/412/412_hd_advanced_debugging_with_xcode_and_lldb.mp4?dl=1", "title": "Advanced Debugging with Xcode and LLDB", "summary": "Discover advanced techniques, and tips and tricks for enhancing your Xcode debugging workflows. Learn how to take advantage of LLDB and custom breakpoints for more powerful debugging. Get the most out of Xcode's view debugging tools to solve UI issues in your app more efficiently."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/302tw1pd3hkgmzuw47/302/302_hd_whats_new_in_managing_apple_devices.mp4?dl=1", "title": "What's New in Managing Apple Devices", "summary": "Learn about new management capabilities for iOS, macOS, and tvOS, tool evolution over the past year, and important changes coming this fall. You'll discover how new MDM features help administrators manage devices more effectively, how educators can enhance the classroom learning environment, and how app developers can make their app a better fit for education and enterprise customers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/401ugfluogxen0222/401/401_hd_localizing_with_xcode_9.mp4?dl=1", "title": "Localizing with Xcode 9", "summary": "Build world-ready apps using Xcode by following some simple steps to manage strings and assets, and display your user interface. Take your localized apps even further with new technologies and features in Xcode 9. Learn how Xcode 9 helps you design, localize, and test your app in multiple languages."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/216p00nq8fwzed/216/216_hd_the_life_of_a_watchos_app.mp4?dl=1", "title": "The Life of a watchOS App", "summary": "watchOS 4 introduces numerous enhancements to the application lifecycle of an app on Apple Watch. This session will outline when your app has runtime, how much time it has, and how to maximize your opportunities to create a great experience on Apple Watch. Learn about background modes new to watchOS 4 and find out how taking snapshots with background app refresh have been simplified."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/211r8euwwl9x4/211/211_hd_touch_bar_fundamentals.mp4?dl=1", "title": "Touch Bar Fundamentals", "summary": "Touch Bar replaces the function keys that have long occupied the top of your keyboard with a versatile MultiTouch input device that features a Retina display. AppKit provides powerful APIs to let you easily leverage the power of Touch Bar in your applications. Learn how to use Touch Bar in your application to add context sensitive commands and flexible content to your user experience. This session will cover the basic concepts, design considerations, standard controls, IB support, and API that you will need to get started using Touch Bar."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/204kty9amomlmk222/204/204_hd_updating_your_app_for_ios_11.mp4?dl=1", "title": "Updating Your App for iOS 11", "summary": "iOS 11 brings a bold, dynamic new style to UI elements systemwide. Learn how to adopt new features in your app, including large title bars with integrated search, landscape tab bars, and more powerful swipe actions. Find out about new patterns and enhancements that make it easier than ever to craft the perfect experience for your users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/606n77zpcxs5ir2/606/606_hd_whats_new_with_screen_recording_and_live_broadcast.mp4?dl=1", "title": "What's New with Screen Recording and Live Broadcast", "summary": "Check out the new capabilities of ReplayKit 2 and see how to access its rich functionality right from Control Center. Learn about in-app capture, giving apps direct sample-level access to their audio and screen output. Get details about developing a live broadcast extension, and discover how apps can be coupled to a preferred broadcast provider."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/209dzcjsnhy5ju/209/209_hd_whats_new_in_tvos.mp4?dl=1", "title": "What's New in tvOS", "summary": "tvOS allows you to deliver incredible apps and games for the big screen with the tvOS SDK. Gain insights into new tvOS 11 capabilities and enhancements such as Right-to-Left support, image overlays, background app updates, and user interface style improvements. And with the new AVKit capabilities you can take your media playback experience even further."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/505e36yrkhhfv/505/505_hd_whats_new_in_photos_apis.mp4?dl=1", "title": "What's New in Photos APIs", "summary": "Learn all about newest APIs in Photos on iOS and macOS, providing better integration and new possibilities for your app. We'll discuss simplifications to accessing the Photos library through UIImagePickerController, explore additions to PhotoKit to support new media types, and share all the details of the new Photos Project Extensions which enable you to bring photo services to Photos for Mac."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/511tj33587vdhds/511/511_hd_working_with_heif_and_hevc.mp4?dl=1", "title": "Working with HEIF and HEVC", "summary": "High Efficiency Image File Format (HEIF) and High Efficiency Video Coding (HEVC) are powerful new standards-based technologies for storing and delivering images and video. Gain insights about how to take advantage of these next generation formats and dive deeper into the APIs that allow you to fully harness them in your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/501fo36iwi2moz2l222/501/501_hd_whats_new_in_audio.mp4?dl=1", "title": "What's New in Audio", "summary": "Apple platforms provide a comprehensive set of audio frameworks that are essential to creating powerful audio solutions and rich app experiences. Come learn about enhancements to AVAudioEngine, support for high-order ambisonics, and new capabilities for background audio recording on watchOS. See how to take advantage of these new audio technologies and APIs in this session."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/251txgutnwpkc4740f/251/251_hd_now_playing_and_remote_commands_on_tvos.mp4?dl=1", "title": "Now Playing and Remote Commands on tvOS", "summary": "Consistent and intuitive control of media playback is key to many apps on tvOS, and proper use and configuration of MPNowPlayingInfoCenter and MPRemoteCommandCenter are critical to delivering a great user experience. Dive deeper into these frameworks and learn how to ensure a seamless experience whether your app is being controlled using Siri, the Siri Remote, or the iOS Remote app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/502cdkomuy9vbj4222/502/502_hd_introducing_musickit.mp4?dl=1", "title": "Introducing MusicKit", "summary": "Get introduced to the new API for the Apple Music subscription service.  Learn how to add Apple Music playback in your own app, and discover how to search the catalogue, manage playback queues, and engage with playlists and recommendations."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/509v96e4gd96rlqyq/509/509_hd_introducing_airplay_2.mp4?dl=1", "title": "Introducing AirPlay 2", "summary": "AirPlay allows you to wirelessly stream content from your iOS device or Mac. Now with AirPlay 2, you can fill the home with multi-room audio. Learn how AirPlay 2 synchronizes playback and provides an even more reliable audio experience, and how to incorporate support for AirPlay 2 into your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/503i6plfvfi7o3222/503/503_hd_introducing_heif_and_hevc.mp4?dl=1", "title": "Introducing HEIF and HEVC", "summary": "High Efficiency Image File Format (HEIF) and High Efficiency Video Coding (HEVC) are powerful new standards-based technologies for storing and delivering images and audiovisual media. Get introduced to these next generation space-saving codecs and their associated container formats. Learn how to work with them across Apple platforms and how you can take advantage of them in your own apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/508wdyl5rm2jy9z8/508/508_hd_image_editing_with_depth.mp4?dl=1", "title": "Image Editing with Depth", "summary": "When using Portrait mode, depth data is now embedded in photos captured on iPhone 7 Plus. In this second session on depth, see which key APIs allow you to leverage this data in your app. Learn how to process images that include depth and preserve the data when manipulating the image. Get inspired to add creative new effects to your app and enable your users to do amazing things with their photos."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/515vy4sl7iu70/515/515_hd_hls_authoring_update.mp4?dl=1", "title": "HLS Authoring Update", "summary": "HTTP Live Streaming (HLS) reliably delivers video to audiences around the world. Key to this reliability is a comprehensive set of tools to help you author, deliver, and validate the HLS streams you create. See what's new in these tools, learn the latest authoring recommendations, and how they apply to advances in HLS such as support for HEVC and IMSC1."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/514tjrrgnguh4k/514/514_hd_error_handling_best_practices_for_http_live_streaming.mp4?dl=1", "title": "Error Handling Best Practices for HTTP Live Streaming", "summary": "HTTP Live Streaming (HLS) reliably delivers media content across a variety of network and bandwidth conditions. However, there are many factors that can impact stream delivery, such as server or encoder failures, caching issues, or network dropouts. Learn the best-practice behaviors that your servers should adopt to maximize reliability, and gain a practical understanding of the errors your app may encounter and how to handle them."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/719d0c0vj588o/719/719_hd_enabling_your_app_for_carplay.mp4?dl=1", "title": "Enabling Your App for CarPlay", "summary": "Understand how to enable your audio, messaging, VoIP calling or automaker app for CarPlay. Audio, messaging and VoIP calling apps use a consistent design that's optimized for use in the car. Automaker apps provide vehicle specific controls and displays to keep drivers connected without leaving CarPlay. Explore best practices and learn about the tools and frameworks for CarPlay apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/603anuihzisyb2a3/603/603_hd_vr_with_metal_2.mp4?dl=1", "title": "VR with Metal 2", "summary": "Metal 2 provides powerful and specialized support for Virtual Reality (VR) rendering and external GPUs. Get details about adopting these emerging technologies within your Metal 2-based apps and games on macOS High Sierra. Walk through integrating Metal 2 with the SteamVR SDK and learn about efficiently rendering to a VR headset. Understand how external GPUs take macOS graphics to a whole new level and see how to prepare your apps to take advantage of their full potential."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/605al19s0mq8dhrdv/605/605_hd_scenekit_in_swift_playgrounds.mp4?dl=1", "title": "SceneKit in Swift Playgrounds", "summary": "Discover tips and tricks gleaned by the Swift Playgrounds Content team for working more effectively with SceneKit on a visually rich app. Learn how to integrate animation, optimize rendering performance, design for accessibility, add visual polish, and understand strategies for creating an effective workflow with 3D assets."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/507koao27wdpt/507/507_hd_capturing_depth_in_iphone_photography.mp4?dl=1", "title": "Capturing Depth in iPhone Photography", "summary": "Portrait mode on iPhone 7 Plus showcases the power of depth in photography. In iOS 11, the depth data that drives this feature is now available to your apps. Learn how to use depth to open up new possibilities for creative imaging. Gain a broader understanding of high-level depth concepts and learn how to capture both streaming and still image depth data from the camera."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/601nzg4idodih222/601/601_hd_introducing_metal_2.mp4?dl=1", "title": "Introducing Metal 2", "summary": "Metal 2 provides near-direct access to the graphics processor (GPU), enabling your apps and games to realize their full graphics and compute potential. Dive into the breakthrough features of Metal 2 that empower the GPU to take control over key aspects of the rendering pipeline. Check out how Metal 2 enables essential tasks to be specified on-the-fly by the GPU, opening up new efficiencies for advanced rendering."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/604r7b4rnjq86/604/604_hd_scenekit_whats_new.mp4?dl=1", "title": "SceneKit: What's New", "summary": "SceneKit is a fast and fully featured high-level 3D graphics framework that enables your apps and games to create immersive scenes and effects. See the latest advances in camera control and effects for simulating real camera optics including bokeh and motion blur. Learn about surface subdivision and tessellation to create smooth-looking surfaces right on the GPU starting from a coarser mesh. Check out new integration with ARKit and workflow improvements enabled by the Xcode Scene Editor."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/504op4c3001w2f222/504/504_hd_advances_in_http_live_streaming.mp4?dl=1", "title": "Advances in HTTP Live Streaming", "summary": "HTTP Live Streaming allows you to stream live and on-demand content to global audiences. Learn about great new features and enhancements to HTTP Live Streaming. Highlights include support for HEVC, playlist metavariables, IMSC1 subtitles, and synchronized playback of multiple streams. Discover how to simplify your FairPlay key handling with the new AVContentKeySession API, and take advantage of enhancements to offline HLS playback."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/609ir1t2xrat06i/609/609_hd_going_beyond_2d_with_spritekit.mp4?dl=1", "title": "Going Beyond 2D with SpriteKit", "summary": "SpriteKit makes it easy to create high-performance, power-efficient 2D games and more. See how to take SpriteKit objects into Augmented Reality through seamless integration with ARKit. Learn about mixing 2D and 3D content and applying realistic transformations. Take direct control over SpriteKit rendering and walk through offline rendering into a Metal texture."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/602pxa6f2vw71ze/602/602_hd_introducing_arkit_augmented_reality_for_ios.mp4?dl=1", "title": "Introducing ARKit: Augmented Reality for iOS", "summary": "ARKit provides a cutting-edge platform for developing augmented reality (AR) apps for iPhone and iPad. Get introduced to the ARKit framework and learn about harnessing its powerful capabilities for positional tracking and scene understanding. Tap into its seamless integration with SceneKit and SpriteKit, and understand how to take direct control over rendering with Metal 2."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/608gcvcpr8gs2/608/608_hd_using_metal_2_for_compute.mp4?dl=1", "title": "Using Metal 2 for Compute", "summary": "Metal Performance Shaders (MPS) provides a highly tuned library of functions that extend the power of the GPU for more than just graphics. With Metal 2, MPS comes to the Mac along with an expanded set of capabilities. Learn how to tap into the latest image processing operations, perform linear algebra operations, and accelerate machine learning algorithms via new primitives and a graph API to build and execute neural networks on the GPU."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/512u8r4crqanrp/512/512_hd_apple_podcasts.mp4?dl=1", "title": "Apple Podcasts", "summary": "Podcasts reach millions of listeners around the world every year. iOS 11 upgrades the Apple Podcasts app to support new feed structures for serialized shows. Discover how to publish your own podcast and take advantage of all the features and capabilities in this comprehensive podcasting session."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/610b2hmj0oh62l0/610/610_hd_from_art_to_engine_with_model_io.mp4?dl=1", "title": "From Art to Engine with Model I/O", "summary": "Model I/O makes it easy to bridge the divide between artists' tools and your custom engine. See how to build a Model I/O-powered art pipeline to bring assets from content creation tools into a Metal 2-based renderer. Learn strategies for baking 3D content into structures optimal for real-time rendering, and best practices for working with animation data, common mesh and model formats, textures, and materials."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/513fzgbviu23l/513/513_hd_high_efficiency_image_file_format.mp4?dl=1", "title": "High Efficiency Image File Format", "summary": "Learn the essential details of the new High Efficiency Image File Format (HEIF) and discover which capabilities are used by Apple platforms. Gain deep insights into the container structure, the types of media and metadata it can handle, and the many other advantages that this new standard affords."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/821kjtggolzxsv/821/821_hd_get_started_with_display_p3.mp4?dl=1", "title": "Get Started with Display P3", "summary": "Wide color displays allow your app to display richer, more vibrant and lifelike colors than ever before. Get a primer on color management, the Display P3 color space, and practical workflow techniques for producing more colorful images and icons."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/813vq78d4cyc3/813/813_hd_writing_great_alerts.mp4?dl=1", "title": "Writing Great Alerts", "summary": "Learn how to create clear, informative, and helpful alerts that will make your app easy and enjoyable to use. Get valuable insights about the proper role for alerts, actionable guidance about writing effective alerts, and techniques for avoiding common pitfalls."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/810rf5oudq18pus/810/810_hd_whats_new_in_ios_11.mp4?dl=1", "title": "What’s New in iOS 11", "summary": "See how the updates to UIKit controls and text styles in iOS 11 can help you design an app with a stronger visual hierarchy, clearer navigation, and a simpler interface that's easier to use."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/704rn4fu5zbv1b8s222/704/704_hd_creating_immersive_apps_with_core_motion.mp4?dl=1", "title": "Creating Immersive Apps with Core Motion", "summary": "Discover how enhancements in authorization simplify accessing sensitive and historical motion data. Learn how to use DeviceMotion effectively and how to leverage SensorRecorder to capture hours of motion data.  Walk through adding immersive motion controls to enhance an existing game."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/235q83l07a9gtq2rhh/235/235_hd_building_visually_rich_user_experiences.mp4?dl=1", "title": "Building Visually Rich User Experiences", "summary": "iOS and macOS have a wide range of graphics and animation technologies for bringing your app designs to life. Get to know the full graphics stack, from the high-level tools in UIKit and AppKit all the way down to low-level frameworks like Metal. Dive deep into Core Animation and learn the techniques used by Apple engineers to build responsive, engaging UI across the ecosystem."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/230lc4n1loob9/230/230_hd_advanced_animations_with_uikit.mp4?dl=1", "title": "Advanced Animations with UIKit", "summary": "So much power has been added to animations on iOS since their inception that it's time to think about animations in a whole new way! Learn to combine and coordinate between multiple animations, resulting in interactive transitions and learn some tips and tricks along the way."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/510lf4jlju5s1/510/510_hd_advances_in_core_image_filters_metal_vision_and_more.mp4?dl=1", "title": "Advances in Core Image: Filters, Metal, Vision, and More", "summary": "Get all the details on how to access the latest capabilities of Core Image. Learn about new ways to efficiently render images and create custom CIKernels in the Metal Shading Language. Find out about all of the new CIFilters that include support for applying image processing to depth data and handling barcodes. See how the Vision framework can be leveraged within Core Image to do amazing things."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/701jvytnoey2yc7222/701/701_hd_your_apps_and_evolving_network_security_standards.mp4?dl=1", "title": "Your Apps and Evolving Network Security Standards", "summary": "Security standards are continuing to evolve to counter emerging threats, and so too must your apps if you want to best protect your users and their data. Learn about new developments in certificate handling, TLS, and certificate status checking on iOS, macOS, watchOS, and tvOS that impact your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/408qiszgcawlgvhh/408/408_hd_whats_new_in_swift_playgrounds.mp4?dl=1", "title": "What’s New in Swift Playgrounds", "summary": "Learn more about the new features in Swift Playgrounds, such as support for localized content and user-added pages. Learn how to leverage these new features to build engaging content in the latest playground book format. Harness external accessories using the new PlaygroundBluetooth framework, and take advantage of new frameworks added in iOS 11."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/205f4nvkct31tv/205/205_hd_whats_new_in_watchos.mp4?dl=1", "title": "What's New in watchOS", "summary": "watchOS 4 adds a new runtime architecture to make your apps run even faster on Apple Watch. Alongside performance gains, watchOS 4 brings numerous enhancements to make robust WatchKit UI layouts, new background modes for navigation and audio apps, Core Bluetooth connectivity to allow devices a direct connection to your wrist, and much more. See what's new and how you'll be able to make your Watch apps even better on watchOS 4."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/214bugobsy7xw94v/214/214_hd_whats_new_in_sirikit.mp4?dl=1", "title": "What's New in SiriKit", "summary": "SiriKit provides a powerful and intuitive way to expose your app's functionality through Siri. Learn how to use the all-new lists and notes domain to jot down notes or complete tasks quickly. See how easy it is to display your app's visual codes for others to scan. And, using SiriKit's new intent parameters, it's easy to customize even more of the UI for your app within Siri. Explore these and numerous other new features that SiriKit brings to iOS 11."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/225kqn87jg4q699q/225/225_hd_whats_new_in_safari_view_controller.mp4?dl=1", "title": "What's New in Safari View Controller", "summary": "Safari View Controller brings Safari's features into your app for browsing the web and logging in with 3rd party services. Learn how to use new APIs to customize Safari View Controller's UI to fit your app's style."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/234otwtryzhno89esd/234/234_hd_whats_new_in_imessage_apps.mp4?dl=1", "title": "What's New in iMessage Apps", "summary": "With a completely redesigned App Store for iMessage and new App Drawer, discovering, installing, and using iMessage apps has never been easier. And now with live message views people can benefit and interact with your iMessage app directly in the transcript. Get the details on how your app can streamline the message sending experience with the new direct send functionality. Hear about important best practices like making the best use of summary text, optimizing snapshots of your iMessage app, and more in order to provide an outstanding user experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/237oyga54hirqaeiwg/237/237_hd_whats_new_in_mapkit.mp4?dl=1", "title": "What's New in MapKit", "summary": "MapKit makes it easy to embed a fully interactive and configurable map directly into your app. Lean about new capabilities to tailor the look of the map view and annotations, more manageable controls and new features that make dealing with a large number of annotations a snap."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/221izy8b17y2dtiy/221/221_hd_whats_new_in_health.mp4?dl=1", "title": "What's New in Health", "summary": "HealthKit has become the standard for apps that help you manage and track your health on iOS and watchOS. Learn about new HealthKit data types in iOS 11, how to create and access workout route data, how to avoid duplication of health data, and enhancements made in HealthKit to support people managing diabetes."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/713tkef4yl0sv3k/713/713_hd_whats_new_in_location_technologies.mp4?dl=1", "title": "What's New in Location Technologies", "summary": "Location technologies are core to delivering context-based services within your app. Discover how advances in the Core Location Framework APIs provide new and more performant features in a manner designed to provide confidence for you privacy-conscious users. See how changes in iOS 11 provide clearer communication to your users of when their location is being queried and allows them to provide more granular access authorization to your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/705d3czqkho1a6u/705/705_hd_whats_new_in_homekit.mp4?dl=1", "title": "What's New in HomeKit", "summary": "Learn about the new types of HomeKit accessories supported in iOS 11, new accessory setup options, and how enhancements to triggers make it possible to automatically run scenes based on who is home, only at certain times, and with more types of accessories.  Understand how improvements to the HomeKit protocol greatly improve the responsiveness of HomeKit accessories.  Discover how HomeKit accessory development is now open for experimentation & exploration."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/231wmbuvx0t3sci6ua/231/231_hd_whats_new_in_core_spotlight_for_ios_and_macos.mp4?dl=1", "title": "What's New in Core Spotlight for iOS and macOS", "summary": "Fundamental to the iOS Search Experience, Core Spotlight is now available on macOS. Using the same APIs that are available for iOS, Core Spotlight lets you index your app's contents without requiring on-disk files. Learn how to provide rich custom Quick Look previews on both macOS and iOS so your users can see the content right in their search results. Get details about how your Core Spotlight items on iOS can participate in the new Drag and Drop feature."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/210ihxlzd3oovy9h/210/210_hd_whats_new_in_core_data.mp4?dl=1", "title": "What's New in Core Data", "summary": "Join the Core Data engineering team and learn about the new features in Core Data.  See how you can easily and automatically include your data in Spotlight to allow users to find content even if it's stored in Core Data.  Learn about new options for indexing your data, and hear the details on a new feature for tracking changes over time."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/712jqzhsxoww3zn/712/712_hd_whats_new_in_core_bluetooth.mp4?dl=1", "title": "What's New in Core Bluetooth", "summary": "Discover how watchOS 4 makes it possible for a watchOS app to communicate with Bluetooth Low Energy accessories.  Learn about changes to Core Bluetooth that improve reliability and enable high performance streaming connections with Bluetooth Low Energy Accessories. Understand the best practices in Bluetooth Low Energy accessory design."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/714nzbj3q51ksj/714/714_hd_whats_new_in_apple_pay__wallet.mp4?dl=1", "title": "What's New in Apple Pay & Wallet", "summary": "Apple Pay is the easy and secure way to accept payments in your app and website on iPhone, iPad, Apple Watch, and Mac. Get the latest news and updates from the Wallet and Apple Pay teams. New for this year, increase your conversions by providing feedback to users right in the Apple Pay sheet. Discover great new Wallet features like pass sharing controls, and increase customer satisfaction and sales with UI best practices."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/207mg6u1b7mfd02n/207/207_hd_whats_new_in_cocoa.mp4?dl=1", "title": "What's New in Cocoa", "summary": "Join us for this annual session to learn about enhancements in Cocoa. Catch up on the latest APIs for Touch Bar, performance improvements like copy-on-write collections, new features such as document sharing, Swift improvements for key paths and archiving, and many other refinements to AppKit and Foundation APIs.  Get an overview of many topics and a guide to important related sessions throughout the week."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/715gk347h3udl/715/715_hd_whats_new_in_apple_file_system.mp4?dl=1", "title": "What's New in Apple File System", "summary": "The Apple File System (APFS) is a modern file system, optimized for responsiveness on Flash/SSD storage, and designed for extensibility, security, and data integrity. APFS is now the default filesystem on iOS, tvOS, and watchOS. Learn about what's new for APFS on the Mac and how to take advantage of its new features in your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/201fz90p4yq582o/201/201_hd_whats_new_in_cocoa_touch.mp4?dl=1", "title": "What's New in Cocoa Touch", "summary": "iOS 11 enhances the Cocoa Touch frameworks for making next generation apps on iOS. Learn about drag and drop, file management, document browser, updates to the navigation and tab bars, app safe areas, swipe actions and API refinements. Find out which sessions you won't want to miss throughout the week."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/232avezuj9uzy0hh5n/232/232_hd_whats_new_in_carekit_and_researchkit.mp4?dl=1", "title": "What's New in CareKit and ResearchKit", "summary": "Whether you're a medical researcher or a care provider, the CareKit and ResearchKit open source projects are designed to be the quickest path to delivering a customized iOS app to your candidates or patients. These frameworks are constantly gaining features and functionality from both Apple and the community. Discover the latest active-tasks, care modules, and tools designed to allow medical professionals the ability prototype their own care app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/506jgz9rblchh/506/506_hd_vision_framework_building_on_core_ml.mp4?dl=1", "title": "Vision Framework: Building on Core ML", "summary": "Vision is a new, powerful, and easy-to-use framework that provides solutions to computer vision challenges through a consistent interface. Understand how to use the Vision API to detect faces, compute facial landmarks, track objects, and more. Learn how to take things even further by providing custom machine learning models for Vision tasks using CoreML."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/507pq8rldk/507/507_hd_whats_new_in_core_audio.mp4?dl=1", "title": "What's New in Core Audio", "summary": "See what's new in Core Audio. Learn about enhancements to AVAudioEngine such as Compressed audio format support, more flexible node connections and new Sequencer functionality. Learn how to take advantage of digital audio between your OS X and iOS devices via Lightning. Learn best practices and what's new in AVAudioSession."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/208wc2mdvock1md/208/208_hd_watchkit_indepth_part_2.mp4?dl=1", "title": "WatchKit In-Depth, Part 2", "summary": "Move beyond architecture changes for Watch apps and explore the different ways you can use the Digital Crown to enhance your apps. Find out how to create persistent app experiences to keep your Watch app at the ready for users and learn how to use the playback and recording APIs to add audio and video to your Watch apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/212mm5ra3oau66/212/212_hd_optimizing_your_app_for_multitasking_on_ipad_in_ios_9.mp4?dl=1", "title": "Optimizing Your App for Multitasking on iPad in iOS 9", "summary": "Multitasking in iOS 9 allows two side-by-side apps and the Picture-in-Picture window to simultaneously run onscreen at the same time. Discover essential techniques for designing efficient, responsive apps to give your users a fluid, immersive experience with Slide Over, Split View, and Picture-in-Picture."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/211dseo3cn0bnw/211/211_hd_multitasking_essentials_for_mediabased_apps_on_ipad_in_ios_9.mp4?dl=1", "title": "Multitasking Essentials for Media-Based Apps on iPad in iOS 9", "summary": "iOS 9 on iPad introduces the ability to view and interact with more than one app at a time. Learn advanced techniques for efficiently sharing resources and presenting media while other apps are in the foreground. Tap into the potential of Picture in Picture to allow your video content to play above other apps, and explore multitasking best practices for creating great experiences in this environment."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/7125ovmdf36/712/712_hd_low_energy_high_performance_compression_and_accelerate.mp4?dl=1", "title": "Low Energy, High Performance: Compression and Accelerate", "summary": "The Accelerate framework gives you fast, energy efficient signal and image processing and linear algebra libraries. Learn about a new library, dedicated to high performance compression. simd.h, introduced in iOS 8 and OS X 10.10, is the unified 2d and 3d math library for graphics and games. Find out how you can use simd.h and what's new in iOS 9 and OS X 10.11."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/508691kyzp/508/508_hd_audio_unit_extensions.mp4?dl=1", "title": "Audio Unit Extensions", "summary": "Learn about using Audio Unit Extensions to provide your App with sophisticated audio manipulation and processing capabilities. Explore the architecture and  fundamentals of an App that uses Audio Unit Extensions, and how your app can benefit from their power."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/5062qehwhs/506/506_hd_editing_movies_in_av_foundation.mp4?dl=1", "title": "Editing Movies in AV Foundation", "summary": "Learn how to use the new AVMutableMovie class to modify media files and simplify your editing workflows. See how to support segment-based editing and discover the power of sample reference movies."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/502sufwcpog/502/502_hd_content_protection_for_http_live_streaming.mp4?dl=1", "title": "Content Protection for HTTP Live Streaming", "summary": "FairPlay streaming provides industrial-grade protection for audio and video content. Learn how to implement and deploy FairPlay streaming to protect content when using HTTP Live Streaming."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/510jiccqsz/510/510_hd_whats_new_in_core_image.mp4?dl=1", "title": "What's New in Core Image", "summary": "The newly-unified architecture of Core Image gives iOS and OS X apps access to even more image processing power. Learn about new CIFilters and enhancements to the CIKernel language. See how to use Core Image with AV Foundation and Metal to expand the capabilities of your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/217wu453thu1r1/217/217_hd_adopting_new_trackpad_features.mp4?dl=1", "title": "Adopting New Trackpad Features", "summary": "The new Force Touch trackpad adds a whole new dimension to user interactions. OS X 10.11 introduces system controls that support pressure behaviors. Understand how to integrate with these behaviors and support them in custom controls. See how to use the Taptic Engine to provide subtle physical feedback based on trackpad input. Hear best practices for adopting new swiping gestures."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/229fksrj39nd/229/229_hd_whats_new_in_uikit_dynamics_and_visual_effects.mp4?dl=1", "title": "What's New in UIKit Dynamics and Visual Effects", "summary": "Dynamic interfaces create fluid and rich interactions. Hear about new dynamic behaviors that have been added in UIKit and how to take advantage of them in your applications. Gain a practical understanding of how to integrate dynamics with AutoLayout. Learn about enhancements to UI Kit Visual Effects."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/604gq12qghmv39znb/604/604_hd_whats_new_in_spritekit.mp4?dl=1", "title": "What's New in SpriteKit", "summary": "SpriteKit provides everything you'll need to build 2D games with high-performance graphics and engaging gameplay. Check out new APIs for managing a virtual camera and delivering spatial audio. See the all-new timeline-based Actions editor built right into Xcode, and learn about deep integration with Metal, SceneKit, GameplayKit, and more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/607g5z16fpl7pzgi/607/607_hd_whats_new_in_metal_part_2.mp4?dl=1", "title": "What's New in Metal, Part 2", "summary": "Your app can be ready to harness the power of Metal starting with just a few lines of code. Get introduced to the new MetalKit framework and learn its simple API for model and texture loading, animation control, and other common tasks. Plug into Metal Performance Shaders and access a powerful library of image-processing operations tuned for Apple hardware."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/6037pi9rxl6tfss8w/603/603_hd_whats_new_in_metal_part_1.mp4?dl=1", "title": "What's New in Metal, Part 1", "summary": "Metal provides extremely efficient access to the GPU through its streamlined API and high-performance architecture. Check out what's new in Metal and dive into support for Metal on OS X. Understand enhancements to the Metal memory model and learn how to prepare assets for delivery in Metal-based apps and games."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/705qrxhfxo0/705/705_hd_whats_new_in_core_motion.mp4?dl=1", "title": "What's New in Core Motion", "summary": "See what's new in Core Motion. Learn how your application can take advantage of the motion sensors on iOS devices. Walk through new features of the pedometer and learn how to use the altimeter to take your app to the next level. Get personal with motion APIs and sensor data on the Apple Watch. Run through a demo that uses motion-context awareness to make an application feel smarter!"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/504m956dgg4hlw2uez9/504/504_hd_whats_new_in_http_live_streaming.mp4?dl=1", "title": "What's New in HTTP Live Streaming", "summary": "HTTP Live Streaming offers a reliable media playback experiences over a wide variety of network conditions. Join us to learn how to deliver offline playback using the same media assets you already host for online playback. See new additions to the HLS protocol, such as support for fragmented MP4 and in-playlist metadata."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/509n1cnykqms19r9jyp/509/509_hd_speech_recognition_api.mp4?dl=1", "title": "Speech Recognition API", "summary": "iOS 10 brings a brand new Speech Recognition API that allows you to perform rapid and contextually informed speech recognition in both file-based and realtime scenarios. In this video, you will learn all about the new API and how to bring advanced speech recognition services into your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/715v2nxofqo5an4q79a/715/715_hd_neural_networks_and_accelerate.mp4?dl=1", "title": "Neural Networks and Accelerate", "summary": "The Accelerate framework gives you fast, energy efficient signal and image processing and linear algebra libraries. Learn about new libraries dedicated to high performance neural networks and numerical integration."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/212s41rh77qgdg26s86/212/212_hd_developing_tvos_apps_using_tvmlkit_part_1.mp4?dl=1", "title": "Developing tvOS Apps Using TVMLKit: Part 1", "summary": "Join us for an introduction to TVMLKit, a template-based UI layout technology that is part of tvOS. Learn about new features coming in tvOS 10, as well as best practices in architecting your application, styling and customization of templates, and media playback."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/601nsio90cd7ylwimk9/601/601_hd_go_live_with_replaykit.mp4?dl=1", "title": "Go Live with ReplayKit", "summary": "ReplayKit is an easy-to-use framework that enables players to share gameplay recordings or broadcast live games to players and viewers online. Watch how live broadcasting can help build community and create new fans for your apps and games. Understand the APIs to include player commentary via the microphone and front-facing camera on iPhone and iPad, and check out new support for ReplayKit on Apple TV."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/229b09xkrv3t6tdzwsu/229/229_hd_developing_tvos_apps_using_tvmlkit_part_2.mp4?dl=1", "title": "Developing tvOS Apps Using TVMLKit: Part 2", "summary": "Learn about advanced techniques in TVML based apps, such as bridging between native and javascript code, creating your own custom views for use inside of templates, creating your own custom templates, how to introduce UIKit view controllers alongside TVMLKit based templates, and additional best practices you can apply to your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/510ndmh9wkcvzneegv2/510/510_hd_validating_http_live_streams.mp4?dl=1", "title": "Validating HTTP Live Streams", "summary": "HTTP Live Streaming enables the reliable delivery of media content over a wide variety of network conditions. Learn best practices in HLS authoring, see how to verify your streams using the HTTP Live Streaming tools, and apply the results to improve the performance of your streams."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/507n0zrhzxdzmg20zcl/507/507_hd_delivering_an_exceptional_audio_experience.mp4?dl=1", "title": "Delivering an Exceptional Audio Experience", "summary": "iOS, macOS, watchOS and tvOS offer a rich set of tools and APIs for recording, processing, and playing back audio in your apps. Learn how to choose the right API for your app, and the details on implementing each of them in order to deliver an outstanding audio experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/505mia12r7dwmk3aumw/505/505_hd_live_photo_editing_and_raw_processing_with_core_image.mp4?dl=1", "title": "Live Photo Editing and RAW Processing with Core Image", "summary": "iOS 10 and macOS 10.12 brings a powerful set of new APIs to work with many types of photos. Explore using Core Image to process RAW image files from many popular cameras and recent iOS devices. See how to edit and enhance Live Photos directly within your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/501l32ujtbnw2ad06wy/501/501_hd_advances_in_ios_photography.mp4?dl=1", "title": "Advances in iOS Photography", "summary": "People love to take pictures with iPhone. In fact, it's the most popular camera in the world, and photography apps empower this experience. Explore new AVFoundation Capture APIs which allow for the capture of Live Photos, RAW image data from the camera, and wide color photos."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/817p12uvpl9vgt/817/817_hd_rich_notifications.mp4?dl=1", "title": "Rich Notifications", "summary": "Discover the keys to creating informative, useful and beautiful rich notifications in iOS. Get practical and detailed guidance about how to design short looks, long looks, and quick actions that will make your app's notifications something people look forward to receiving."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/242vuobd1jbmqgaxcq/242/242_hd_the_keys_to_a_better_text_input_experience.mp4?dl=1", "title": "The Keys to a Better Text Input Experience", "summary": "Go beyond the basics and provide a first class text input experience in your app. Learn best practices and how to expand your app by supporting text input traits and QuickType. Get tips on how to optimize your UI when incorporating the system keyboard into your layout. Discover how to create a custom keyboard and upgrade it to a system-wide keyboard extension."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/208tpmh7cwo17vk/208/208_hd_natural_language_processing_and_your_apps.mp4?dl=1", "title": "Natural Language Processing and your Apps", "summary": "Discover how to enhance app intelligence by using machine learning and natural language processing (NLP). Learn how to use our performant on-device NLP APIs to break text into sentences and tokens, identify people and places mentioned in the text (typed, transcribed speech/handwriting). The NLP APIs can be used standalone or as a preprocessing framework for machine-learning based text modeling tasks. The APIs are available in many languages across all Apple platforms, thereby providing homogeneous text processing for consistent user experience. Open up your imagination as we walk you through hypothetical apps that harness the power of NLP to enhance the overall app experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/213zpcyn0q9if99c/213/213_hd_mastering_drag_and_drop.mp4?dl=1", "title": "Mastering Drag and Drop", "summary": "Dive deep into the new Drag and Drop APIs in iOS 11. Learn what users will come to expect of your draggable views and how to best deal with the asynchronous nature by which data gets dropped into your app. We'll also show you how to make your Drag and Drop look great using the advanced visual appearance tweaks that we offer."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/816mg1phgy05k3v222/816/816_hd_love_at_first_launch.mp4?dl=1", "title": "Love at First Launch", "summary": "Engage people from the first moment they open your app, and keep them coming back for more. Learn tips on how to make a compelling first impression, methods for teaching new users about your app, and best practices when asking users for more information."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/206efq12yy8kg/206/206_hd_introducing_password_autofill_for_apps.mp4?dl=1", "title": "Introducing Password AutoFill for Apps", "summary": "Logging in to an app is a source of friction that can lead to user abandonment. Password AutoFill is a new feature in iOS 11 that makes logging in easy by putting users' passwords directly on the keyboard in your login UI. Learn how to guarantee that Password AutoFill works in your app to make logging in a frictionless experience for your users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/203atfalwz52js4444/203/203_hd_introducing_drag_and_drop.mp4?dl=1", "title": "Introducing Drag and Drop", "summary": "Drag and Drop has arrived in iOS 11! Learn the fundamentals behind the new iOS Drag and Drop — architecture and APIs. This session will go over the design goals, architecture and key components of the API to allow you to quickly adopt Drag and Drop in your App."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/808qnk3ctygo5hd/808/808_hd_planning_a_great_apple_watch_experience.mp4?dl=1", "title": "Planning a Great Apple Watch Experience", "summary": "Creating a great Watch experience involves planning and attention to detail. Learn how to focus your development for Apple Watch to ensure that the experience is timely and contextually relevant for your users. Walk through a case study of the WWDC Watch app and gain insights from the development team's experience across three versions of the app. Finally, learn design and technical tips for making your watchOS app the best it can be."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/248l3bagtus6l8jwxh/248/248_hd_localization_best_practices_on_tvos.mp4?dl=1", "title": "Localization Best Practices on tvOS", "summary": "Expand the reach of your apps by building them for a worldwide audience. Learn how to create localized tvOS apps that perform seamlessly regardless of country and language. Gain insights into such topics as handling server-side content, matching preferred languages, and localizing images and text direction."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/241iivj8rn2fo3ft0r/241/241_hd_introducing_pdfkit_on_ios.mp4?dl=1", "title": "Introducing PDFKit on iOS", "summary": "The enhanced PDFKit framework lets your app perform essential operations, such as authoring, modifying, and displaying Portable Document Format (PDF) files. Previously available only on macOS, this powerful framework is now available on iOS 11. Gain insights and best practices on how to use this technology within your own apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/219okz4tp7uyw5n/219/219_hd_modern_user_interaction_on_ios.mp4?dl=1", "title": "Modern User Interaction on iOS", "summary": "Touch user interactions are fundamental to the user experience on iOS. Learn how to master the power of UIKit's gesture recognizer system in your application. Find out how to integrate with the new Drag and Drop features and the system gestures. Get some great tips for debugging your custom built interactions."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/702lyr2y2j09fro222/702/702_hd_privacy_and_your_apps.mp4?dl=1", "title": "Privacy and Your Apps", "summary": "Protecting user privacy is a core principal in the Apple ecosystem. Learn what that means for the way you design and implement your apps, and learn about privacy-related changes, including new APIs, in the next versions of iOS, macOS, watchOS and tvOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/718jes6q3aac0f1a/718/718_hd_introducing_core_nfc.mp4?dl=1", "title": "Introducing Core NFC", "summary": "Core NFC is an exciting new framework that enables you to read NFC tags in your apps on iPhone 7 and iPhone 7 Plus.  Learn how to integrate Core NFC into your apps, key requirements for using this feature, and start thinking about the new kinds of apps that are enabled with NFC capabilities."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/703muvahj3880222/703/703_hd_introducing_core_ml.mp4?dl=1", "title": "Introducing Core ML", "summary": "Machine learning opens up opportunities for creating new and engaging experiences. Core ML is a new framework which you can use to easily integrate machine learning models into your app. See how Xcode and Core ML can help you make your app more intelligent with just a few lines of code."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/224sn8vw625k1e86/224/224_hd_focus_interaction_in_tvos_11.mp4?dl=1", "title": "Focus Interaction in tvOS 11", "summary": "Focus interaction is the primary interaction model for UIKit-based apps on tvOS. Learn about new focus animation APIs, custom sounds, support for SceneKit and SpriteKit games, and new debugging tools for your development workflows. Gain insight into how to get the most from these new technologies in your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/820i9qakfac65nsp/820/820_hd_express_yourself.mp4?dl=1", "title": "Express Yourself!", "summary": "iMessage Apps help people easily create and share content, play games, and collaborate with friends without needing to leave the conversation. Explore how you can design iMessage apps and sticker packs that are perfectly suited for a deeply social context."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/249alewpia5158ow5k/249/249_hd_filtering_unwanted_messages_with_identity_lookup.mp4?dl=1", "title": "Filtering Unwanted Messages with Identity Lookup", "summary": "Unwanted SMS and MMS messages are a persistent, frustrating nuisance. Identity Lookup is a new framework that allows you to participate in the process of filtering incoming messages. Get the details of how to identify and prevent these unsolicited messages. Understand the options for on-device detection as well as more dynamic server-based integration in order to ensure a better user experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/243eh39ob5y0z0ktg5/243/243_hd_file_provider_enhancements.mp4?dl=1", "title": "File Provider Enhancements", "summary": "File providers are front and center in the new Files app and system-provided document browser, empowering users to work on their documents in the cloud without the confusion of multiple copies or different versions. Hear details about how your cloud services can integrate with this new functionality. See how to provide an efficient and seamless user experience. If you are an app developer, learn the details about how file providers work and hear about exciting opportunities to take advantage of service-specific APIs from cloud storage providers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/250lnw83hnjfutowrg/250/250_hd_extend_your_apps_presence_with_deep_linking.mp4?dl=1", "title": "Extend Your App’s Presence with Deep Linking", "summary": "Learn about deep linking and how universal links can be used to make your app's content and functionality accessible throughout iOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/247yvk4zop0czpm7s6/247/247_hd_extend_your_apps_presence_with_sharing.mp4?dl=1", "title": "Extend Your App's Presence With Sharing", "summary": "Help your users share the great content in your app by using the built-in iOS sharing functionality. Learn how timing, placement and context of sharing can drive engagement and acquire new users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/802i3ngpjoeupj/802/802_hd_essential_design_principles.mp4?dl=1", "title": "Essential Design Principles", "summary": "Design principles are the key to understanding how design serves human needs for safety, meaning, achievement and beauty. Learn what these principles are and how they can help you design more welcoming, understandable, empowering and gratifying user experiences."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/717tmz5rl6c2t2k/717/717_hd_developing_wireless_carplay_systems.mp4?dl=1", "title": "Developing Wireless CarPlay Systems", "summary": "Wireless CarPlay is perfect for any trip. Get in your car without taking your iPhone out of your bag or pocket, and start experiencing CarPlay effortlessly. Learn how to design your CarPlay system to connect wirelessly to iPhone. Understand hardware requirements, best practices for a great user experience, and how to optimize the pairing and reconnection process."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/819bp5li4iugvy222/819/819_hd_designing_for_a_global_audience.mp4?dl=1", "title": "Designing for a Global Audience", "summary": "The worldwide reach of the App Store means that your app can be enjoyed by people from around the globe. Explore ways to make your app useful and appealing to as many people as possible. And pick up simple techniques for avoiding common issues when reaching a global audience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/803gyqggd62btz0/803/803_hd_designing_sound.mp4?dl=1", "title": "Designing Sound", "summary": "Design is not just about what people see, it's also about what they hear. Learn about how sound design can help you create a more immersive, usable and meaningful user experience in your app or game, and get a glimpse of how the sounds in Apple products are created."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/1075hpxmc54818sn59su/107/107_hd_whats_new_in_cocoa_touch.mp4?dl=1", "title": "What's New in Cocoa Touch", "summary": "iOS 9 expands on adaptivity with Multitasking. Learn about additions to UIKit to support truly universal layout sizes and types. Get introduced to all-new frameworks and APIs for Cocoa Touch such as a new Contacts framework, text-editing gestures, enhancements to dynamics and visual effects, and much more. Come find out which sessions you won't want to miss throughout the week."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/602868pb0ow6idb3w/602/602_hd_managing_3d_assets_with_model_io.mp4?dl=1", "title": "Managing 3D Assets with Model I/O", "summary": "Model I/O provides a seamless infrastructure for accessing and managing 3D models. Its high-performance architecture supports reading and writing popular mesh and model formats, textures, and materials. Get introduced to the Model I/O framework and learn key details about its integration with SceneKit, MetalKit, and GLKit."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/216isrjt4ku9w4/216/216_hd_layout_and_animation_techniques_for_watchkit.mp4?dl=1", "title": "Layout and Animation Techniques for WatchKit", "summary": "Advanced layouts and animations are essential to your app's interface. Gain insights into group layout mechanics and the new element animation APIs introduced in WatchKit for watchOS 2. Understand how to create layouts that work well with animations and learn other techniques to add liveliness to your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/223ehejg7kebf8wl/223/223_hd_drag_and_drop_with_collection_and_table_view.mp4?dl=1", "title": "Drag and Drop with Collection and Table View", "summary": "Discover new APIs for UICollectionView and UITableView designed to make drag and drop easy to implement in your apps. Learn how to quickly adopt drag and drop in collection and table views, create polished animations, and adopt new features to keep your app fluid and responsive during asynchronous data transfers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/214dh5q5d0kswh/214/214_hd_introducing_on_demand_resources.mp4?dl=1", "title": "Introducing On Demand Resources", "summary": "iOS 9 introduces On Demand Resources, enabling the efficient delivery of rich games and full featured applications using dynamically loaded content. Significantly reduce the time between purchasing and running an app from the App Store, while also decreasing the required storage space by downloading and retaining only content that is necessary. Dive into the latest enhancements in app packaging and learn the APIs to allow your app to acquire only its essential resources."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/501g8vwlgg2/501/501_hd_whats_new_in_web_development_in_webkit_and_safari.mp4?dl=1", "title": "What's New in Web Development in WebKit and Safari", "summary": "Learn about exciting new features in WebKit and Safari that will help you make your content feel alive. See compelling new interactions made possible by the Force Touch trackpad and enhanced scrolling support. Expand your design toolkit with high performance filters for stunning image and backdrop effects, and embrace the connected living room with updated AirPlay support."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/609pzlyunriyjupp/609/609_hd_deeper_into_gameplaykit_with_demobots.mp4?dl=1", "title": "Deeper into GameplayKit with DemoBots", "summary": "Dive into the tools and technologies used to construct the DemoBots developer sample. Gain a practical understanding of how DemoBots implements its gameplay logic with GameplayKit and visuals using SpriteKit.  See how the sample integrates On Demand Resources and other system services."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/608rpwq1ltvg5nmk/608/608_hd_introducing_gameplaykit.mp4?dl=1", "title": "Introducing GameplayKit", "summary": "GameplayKit provides a collection of essential tools and techniques used to implement gameplay logic. Get introduced to the GameplayKit framework and see how to put its capabilities to work in your own titles. Learn about managing state machines, controlling game entities, and implementing rule systems. Dive into its built-in tools for randomization, pathfinding, and advanced simulation."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/233l9q8hj9mw/233/233_hd_advanced_touch_input_on_ios.mp4?dl=1", "title": "Advanced Touch Input on iOS", "summary": "Learn about the touch input and drawing pipelines. Gain specific insights in how best to design your app to minimize latency in receiving touches and maximizing the performance of drawing content on the screen. Explore new API in UIKit and learn best practices for faster and smoother input."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/719ui2k57m/719/719_hd_your_app_and_next_generation_networks.mp4?dl=1", "title": "Your App and Next Generation Networks", "summary": "IPv6 is growing exponentially and carriers worldwide are moving to pure IPv6 APNs. Learn about new tools to test your apps for compatibility and get expert advice on making sure your apps work in all network environments.  iOS 9 and OS X 10.11 now support the latest TCP standards. Hear from the experts on TCP Fast Open and Explicit Congestion Notification, and find out how it benefits your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/606ui2ppsvalj4nn/606/606_hd_enhancements_to_scenekit.mp4?dl=1", "title": "Enhancements to SceneKit", "summary": "SceneKit is a high-level graphics framework that helps you create 3D animated scenes and effects in your apps. See how to take advantage of the new capabilities and performance gains enabled by SceneKit's new Metal-based renderer. Check out the innovative Scene Editor, enabling you to build game levels and other scenes directly within Xcode. Learn about new features for realistic shading, enhancements for physics, and dynamic spatial audio."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/6053hq2fz0ebo0lm/605/605_hd_going_social_with_replaykit_and_game_center.mp4?dl=1", "title": "Going Social with ReplayKit and Game Center", "summary": "ReplayKit provides an easy-to-use framework that lets players record their gameplay — amazing plays, great victories, or solutions to tough challenges — and share video with other players and viewers online. Get introduced to the ReplayKit framework and see how to enable its capability for sharing game video and audio in your games and other apps. Then get the latest news about Game Center, Apple's social gaming network. Learn about the new model for pre-release testing with Game Center and enhancements for multiplayer games."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/720xwbi9nl/720/720_hd_whats_new_in_notifications.mp4?dl=1", "title": "What's New in Notifications", "summary": "Remote notifications are sent by your server to the Apple Push Notification service, which pushes the notifications to each device. Your app may take different actions, such as displaying a message to the user or downloading new data. Find out about important changes to the provider protocol. Learn about enhancements to the way your app can respond to notifications."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/717yq4y85w/717/717_hd_whats_new_in_network_extension_and_vpn.mp4?dl=1", "title": "What's New in Network Extension and VPN", "summary": "The Network Extension framework allows apps to customize and extend the core networking features of iOS and OS X. Learn how to use new VPN features and NetworkExtension API to create network security solutions for education and enterprise."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/225629tzulwe0/225/225_hd_whats_new_in_nscollectionview.mp4?dl=1", "title": "What's New in NSCollectionView", "summary": "NSCollectionView has been displaying grids of views for many years.  OS X 10.11 brings a major update to the capabilities of NSCollectionView.  Much of the design of UICollectionView in iOS is now available for OS X apps.  Understand the details of the enhancements and how you can harness them in your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/227s0ti458qgg/227/227_hd_whats_new_in_internationalization.mp4?dl=1", "title": "What's New in Internationalization", "summary": "With the majority of Apple's market outside of the US, it's critical to learn about the latest advancements in Internationalization support to make your app truly localized. Gain insight into best practices for using formatters to display information correctly, how to easily handle pluralization in any language, how to avoid the most common localization pitfalls, and much more. Whether you are looking to significantly expand your market or want to take advantage of powerful new features for all languages, you don't want to miss this session."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/210oyq5peqlavb/210/210_hd_whats_new_in_homekit.mp4?dl=1", "title": "What's New in HomeKit", "summary": "HomeKit is Apple's framework that enables apps to easily and securely interact with HomeKit enabled accessories such as lights, locks, thermostats and more. Learn about the improvements to HomeKit, including support for new accessory types, easy ways to setup and remotely manage accessories."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/206v5ce46maax7s/206/206_hd_whats_new_in_mapkit.mp4?dl=1", "title": "What's New in MapKit", "summary": "See what's new in MapKit. Learn about improvements to existing APIs and new ways of incorporating transit ETAs and Flyover map views in your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/203bxvbtrom9t1t/203/203_hd_whats_new_in_healthkit.mp4?dl=1", "title": "What's New in HealthKit", "summary": "HealthKit is Apple's framework to centralize the data storage of personal health information. Hear about the latest enhancements to the framework, supporting new types of data, efficiently deleting objects, and integrating HealthKit into your Apple Watch app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/714tqy593v/714/714_hd_whats_new_in_core_location.mp4?dl=1", "title": "What's New in Core Location", "summary": "Learn what's new in Core Location. Discover how to use Core Location with Apple Watch, and how to make the best use of location services to develop powerful and compelling apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/220lgx5lvphj2/220/220_hd_whats_new_in_core_data.mp4?dl=1", "title": "What's New in Core Data", "summary": "Learn about the latest enhancements to the Core Data framework. Hear how to efficiently delete objects, ensure uniqueness, and easily migrate your persistent stores to new locations."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/2023wpov1sxpnf9/202/202_hd_whats_new_in_cocoa.mp4?dl=1", "title": "What's New in Cocoa", "summary": "Cocoa is a powerful set of frameworks on which OS X is built. Gain an overview of the advances in AppKit, Foundation, and related frameworks. Find out what technologies you need to focus on and what techniques you should adopt to develop state of the art apps for OS X. Start here for a high level view of what's changed, and get pointers to relevant sessions for more depth."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/704ci202euy/704/704_hd_whats_new_in_cloudkit.mp4?dl=1", "title": "What's New in CloudKit", "summary": "CloudKit is the framework that powers iCloud on iOS, OS X, and now iCloud on the web. Hear how we've been working to make CloudKit more accessible to all your users with the web services API and Javascript library. Learn about reporting available in the updated Dashboard and the new, more flexible public database storage pricing."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/207id8oiaxrt6lh/207/207_hd_watchkit_indepth_part_1.mp4?dl=1", "title": "WatchKit In-Depth, Part 1", "summary": "watchOS 2 provides a new architecture that runs your WatchKit extension directly on Apple Watch. Take an in-depth look at how this new architecture works. Learn how to migrate existing WatchKit apps to watchOS 2, how to support both versions of watchOS, and hear about updates to Glances and Notifications."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/701i2qis0reg/701/701_hd_wallet__the_home_for_apple_pay_and_more.mp4?dl=1", "title": "Wallet - The home for Apple Pay and more", "summary": "Passbook is now Wallet.  Wallet stores your coupons, boarding passes, event tickets, and even the credit and debit cards you use with Apple Pay. In iOS 9, Wallet makes the Apple Pay experience even better and integrates more with Apple Watch.  Learn about the Wallet app, new kinds of passes, and how your app can integrate and interact with Wallet."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/5059xl75l59/505/505_hd_using_safari_to_deliver_and_debug_a_responsive_web_design.mp4?dl=1", "title": "Using Safari to Deliver and Debug a Responsive Web Design", "summary": "Safari has a powerful new interface for designing responsive web experiences. Explore this great new feature and other new capabilities and improvements to the Web Inspector—WebKit's built-in development tool. Discover how you can use Safari and Web Inspector to powerfully and efficiently design, debug, and optimize for the web."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/706nu20qkag/706/706_hd_security_and_your_apps.mp4?dl=1", "title": "Security and Your Apps", "summary": "Your reputation depends on protecting your users' data. Do this by taking advantage of the Security frameworks built into iOS, OS X and watchOS. Find out about new developments in Security and learn the best practices to develop secure apps and protect your users' data."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/306vjwcqnm/306/306_hd_supporting_the_enterprise_with_os_x_automation.mp4?dl=1", "title": "Supporting the Enterprise with OS X Automation", "summary": "Automation is the life blood of any organization, providing speed, accuracy, and the ability to efficiently scale in-house processes. See how the automation technologies in OS X can easily and quickly configure shared-use iOS devices, generate, update, and distribute company documents and provide reliable desktop solutions for the back-office. With tools like Automator, AppleScript, and the new JavaScript for Automation (JXA), creating problem-solving solutions has become even easier and even more interesting."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/5091mxk00t/509/509_hd_seamless_linking_to_your_app.mp4?dl=1", "title": "Seamless Linking to Your App", "summary": "Learn how to increase app engagement by using universal links to lead users directly to your App when they tap links to your website. Discover how Smart App Banners and Shared Web Credentials give your users the most integrated mobile experience possible."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/503lkp4vimgv7tqecn7/503/503_hd_advances_in_avfoundation_playback.mp4?dl=1", "title": "Advances in AVFoundation Playback", "summary": "AVFoundation is a powerful framework for media operations, providing capture, editing, playback, and export. Learn about new APIs and methods for media playback. Create seamless loops, simplify your playback logic with \"autowait\", and see how to deliver an even faster playback startup experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/506ms2tv71tcduwp3dm/506/506_hd_avkit_on_tvos.mp4?dl=1", "title": "AVKit on tvOS", "summary": "AVKit on tvOS offers an intuitive user interface for interaction with your media on this powerful new platform. AVKit is built on AVFoundation, which gives you access to the full potential of platform services for operating on time-based audiovisual media. Learn how to leverage the new content proposal APIs, and how to create a seamless interstitial playback experience. Management of media metadata and chapter navigation will also be covered."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/511nqyciexman7sf932/511/511_hd_avcapturephotooutput__beyond_the_basics.mp4?dl=1", "title": "AVCapturePhotoOutput - Beyond the Basics", "summary": "Continue your learning from Session 501: Advances in iOS Photography, with some additional details on scene monitoring and resource management in AVFoundation's powerful new AVCapturePhotoOutput API."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/712ugi7vg8jznn3pc3u/712/712_hd_working_with_wide_color.mp4?dl=1", "title": "Working with Wide Color", "summary": "Discover the fascinating details behind the display of color on Apple platforms. Go beyond the basics and learn how your apps can take advantage of a wider and deeper representation of color on iOS and macOS. Gain specific insights from the experts on optimizing your artwork asset pipeline and explore new API to develop more vivd, true to life experiences."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/608p3mqohp4bat0id7s/608/608_hd_whats_new_in_gameplaykit.mp4?dl=1", "title": "What's New in GameplayKit", "summary": "GameplayKit provides developers a collection of essential tools and techniques used to implement modern gameplay algorithms. Learn what's new in GameplayKit and check out advances in pathfinding, autonomous agents, and game AI, as well as many enhancements supporting GameplayKit in Xcode. Tap into new capabilities for 2D and 3D spatial partitioning, and explore noise-based procedural data generation useful for height maps, natural textures, and more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/610p9xtklo7t2au11md/610/610_hd_whats_new_in_spritekit.mp4?dl=1", "title": "What's New in SpriteKit", "summary": "SpriteKit adds new features to make it even easier to create high-performance, power-efficient 2D games. See how tile maps enable you to lay out large scenes quickly and check out new APIs for warp transformations and custom shader attributes. Learn about focus-based interactions on Apple TV, rendering on Apple Watch, and new tools built right into Xcode for measuring performance and integrating with GameplayKit."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/713uqrvfj3uo0xewc37/713/713_hd_health_and_fitness_with_core_motion.mp4?dl=1", "title": "Health and Fitness with Core Motion", "summary": "Core Motion enables your applications to access a wide array of sensors on iOS and watchOS devices. Discover how steps and activity detection can be used with user elevation changes to develop fitness apps. Explore ways to observe wrist rotation and effort and translate them to immersive health and fitness experiences."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/611qdyg26bqfivpaww1/611/611_hd_whats_new_in_game_center.mp4?dl=1", "title": "What's New in Game Center", "summary": "Dive into the latest additions to Game Center, Apple's social gaming network. Check out new capabilities for persistent game sessions and how they provide added flexibility for single-player, real-time multiplayer, and turn-based games. Learn about changes that streamline Game Center and a new way to send game invites and join multiplayer matches."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/605ooaey8tbzegv8fth/605/605_hd_whats_new_in_metal_part_2.mp4?dl=1", "title": "What's New in Metal, Part 2", "summary": "Discover enhancements to the Metal shading language and how to use function specialization to improve performance while reducing the number of shader configurations in your app. Take advantage of resource read-writes to enable amazing new rendering techniques, understand how to support wide color, and accelerate your deep learning algorithms using the Metal Performance Shaders framework."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/604oezpg3wmqrkxl0t7/604/604_hd_whats_new_in_metal_part_1.mp4?dl=1", "title": "What's New in Metal, Part 1", "summary": "Metal is the powerful low-overhead graphics and compute technology designed to unlock the power of the GPU. Check out the latest additions to the Metal frameworks and get details about supporting tessellation in your apps and games. Discover how to take control over synchronization and learn how to use resource heaps for even more efficient memory usage. See what's new in Metal debugging and profiling tools and gain insight into analyzing and optimizing performance."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/612qhqi7kh3399jwhy7/612/612_hd_game_technologies_for_apple_watch.mp4?dl=1", "title": "Game Technologies for Apple Watch", "summary": "watchOS 3 adds a lineup of technologies for developing games that are responsive, lightweight, and fun. Gain insights into techniques for creating great games for Apple Watch. Discover how to take advantage of gesture recognizers and the Digital Crown for gameplay, SpriteKit and SceneKit for 2D and 3D graphics, and Game Center for turn-based multiplayer games."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/607odzb3n443nv9ei5p/607/607_hd_controlling_game_input_for_apple_tv.mp4?dl=1", "title": "Controlling Game Input for Apple TV", "summary": "Apple TV presents an incredible opportunity for developers to create new games made for the living room. See how the Game Controller framework can tap into the Siri Remote to harness touch and the built-in accelerometer and gyroscope to deliver engaging gameplay. Learn how to fully integrate MFi controllers, and understand best practices for developing titles that require a game controller."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/609pxdzx9vsps1l0qdh/609/609_hd_advances_in_scenekit_rendering.mp4?dl=1", "title": "Advances in SceneKit Rendering", "summary": "SceneKit is a fully featured high-level graphics framework enabling your apps and games to create 3D animated scenes and effects. Witness the biggest leap forward in SceneKit yet with the introduction of its new Physically-Based Renderer (PBR). Dive into new APIs for accurate materials, physically-based lights, HDR effects, and enhancements in Model I/O. Walk through an example game using PBR and see how to integrate its workflow into your development."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/224g9mui5qb06o6ukpf/224/224_hd_imessage_apps_and_stickers_part_2.mp4?dl=1", "title": "iMessage Apps and Stickers, Part 2", "summary": "Messages apps allow people to collaborate by using your app. Learn how people can work together to accomplish a task within the conversation. Customize the appearance of the messages your app can send. Learn about how to manage your app state in one-to-one and group conversations to provide an engaging and collaborative experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/603oba298b1v4z54011/603/603_hd_adopting_metal_part_2.mp4?dl=1", "title": "Adopting Metal, Part 2", "summary": "Building on the fundamentals, dive into the specifics of constructing games and graphics apps with Metal. Learn about scene management and understand how to manage and update Metal resources. Understand the rendering loop, command encoding, and multi-thread synchronization."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/602o05a86ysk0ngvlgj/602/602_hd_adopting_metal_part_1.mp4?dl=1", "title": "Adopting Metal, Part 1", "summary": "Metal provides the best access to the GPU on iOS, tvOS, and macOS, enabling you to maximize the graphics and compute potential of your apps and games. Get introduced to the essential concepts behind Metal, its low-overhead architecture, streamlined API, and support for efficient multi-threading. Start learning how to code with Metal in a walkthrough of rendering a basic scene."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/226aey4ryxex6rvqvn1/226/226_hd_whats_new_with_cloudkit.mp4?dl=1", "title": "What's New with CloudKit", "summary": "CloudKit is the framework that powers iCloud services on all of Apple's platforms. Learn about the new features that have been added over the past year, and dive deep into the new sharing APIs that lets you share private data between iCloud users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/704s1a6rjyi2dqhhyi7/704/704_hd_whats_new_with_wallet_and_apple_pay.mp4?dl=1", "title": "What's New with Wallet and Apple Pay", "summary": "Get the latest news and updates from the Wallet and Apple Pay teams. Learn how to integrate Apple Pay into more places than ever before including watchOS, iOS Messages and Intents extensions. Learn about new tools to make testing and developing your Apple Pay-enabled apps even easier. We'll also cover new features in Wallet for retailers, banks, and card issuers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/208j30f4v1a1i9i5fg9/208/208_hd_whats_new_in_watchos_3.mp4?dl=1", "title": "What's New in watchOS 3", "summary": "watchOS 3 brings together notifications, complications, and the new Dock to keep your apps glanceable and responsive. Find out about the new additions to watchOS to create stunning visuals and learn about new snapshotting APIs to ensure your app is up to date when people glance at their wrist. Take a tour of watchOS 3 enhancements with us and find out which sessions you won't want to miss throughout the week."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/204t23fvanrkj7a1oj7/204/204_hd_imessage_apps_and_stickers_part_1.mp4?dl=1", "title": "iMessage Apps and Stickers, Part 1", "summary": "Messages allows your apps to create an expressive experience within a conversation. Get an overview of the iMessage App architecture. See how Xcode can easily create a simple sticker pack with your art. Learn how to make an iMessage app that has a custom sticker grid and can make any image you create into a sticker. Go beyond the basic sticker and create animated stickers. Learn how to perfect your iMessage app presentation and layout."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/206a38wgme6uponcuwd/206/206_hd_whats_new_in_tvos.mp4?dl=1", "title": "What's New in tvOS", "summary": "Apps are quickly changing how we experience TV today, and tvOS is the foundation upon which new apps and ideas are being built. Take your app to the next level with great new features in tvOS 10. Learn all about the new interface appearance APIs, support for badging and notifications, and more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/724x4wbpmrtkjpgfdlj/724/724_hd_whats_new_in_the_apple_push_notification_service.mp4?dl=1", "title": "What's New in the Apple Push Notification Service", "summary": "Starting with a review of the HTTP/2 based provider API, you will learn about an important new feature: Token Based Authentication. Learn to connect to APNs using authentication tokens for sending pushes via the HTTP/2 API, relieving you of the overhead associated with maintaining valid certificates."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/219g66mxt0n74iogsgp/219/219_hd_whats_new_in_uicollectionview_in_ios_10.mp4?dl=1", "title": "What's New in UICollectionView in iOS 10", "summary": "UICollectionView is a powerful class allowing your app to manage and customize the layout of views. iOS 10 brings enhancements for better performance, easier layout and brings features you've been looking for. Learn how to make your apps richer and faster by using new features in UICollectionView and its sibling, UITableView."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/804imgsi9d6q5n/804/804_hd_designing_across_platforms.mp4?dl=1", "title": "Designing Across Platforms", "summary": "Learn techniques for determining which Apple platforms are right for your app and how to create a great user experience by designing for the unique capabilities and strengths of each platform."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/232biqdny8x84wjag07/232/232_hd_whats_new_in_international_user_interfaces.mp4?dl=1", "title": "What's New in International User Interfaces", "summary": "Building a great international user interface goes beyond just translating your app. Explore new and improved APIs in iOS, macOS, and watchOS, and learn how Xcode 8 makes it easy to provide directional images to build first class apps for RTL languages. Hear from experts on how to fine-tune your international UI to create a seamless bidirectional experience and take your app in a new direction."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/706sgjvzkvg6rrg9icw/706/706_hd_whats_new_in_security.mp4?dl=1", "title": "What's New in Security", "summary": "Designing security into your app requires that you follow secure coding practices and use the security features that are built into the operating system. Learn about new developments in Security on iOS, macOS, watchOS and tvOS that impact your apps. Hear about best practices for developing and distributing secure apps and protecting people's data."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/234dvn2mhmc3klk7vy4/234/234_hd_whats_new_in_researchkit.mp4?dl=1", "title": "What's New in ResearchKit", "summary": "ResearchKit is an open source framework you can use to build compelling apps that gather and present meaningful data used in medical research. Learn about new capabilities, how to create and extend surveys, how to create active tasks that use touch or other built-in and third-party accessory features, and how to effectively participate in the community."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/710tkhyprou9hhbnc6g/710/710_hd_whats_new_in_homekit.mp4?dl=1", "title": "What's New in HomeKit", "summary": "Learn what's new with HomeKit in iOS 10 including support for new types of accessories such as cameras and doorbells, enhancements in remotely connecting with accessories, how set up of Wi-Fi HomeKit accessories has been greatly improved, and how to write HomeKit enabled tvOS Apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/811evqx1dsujdj5222/811/811_hd_design_tips_for_great_games.mp4?dl=1", "title": "Design Tips for Great Games", "summary": "Great games transport us into another world where we can reign over a kingdom, fight epic battles, or become a pinball wizard. Learn on-boarding and UI design best practices that will enable everyone to lose themselves in your game and have fun."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/806ph0c9ysyu1/806/806_hd_design_for_everyone.mp4?dl=1", "title": "Design For Everyone", "summary": "By understanding the range of abilities and capabilities of the people who use our apps, you can design robust apps that work for everyone. Learn how designing for accessibility and inclusiveness can do social good, widen participation, and enable everyone to benefit."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/246oh3k8zgxi921jxq/246/246_hd_deep_linking_on_tvos.mp4?dl=1", "title": "Deep Linking on tvOS", "summary": "Design features such as the tvOS Top Shelf and Universal Links help customers immerse themselves in your content more quickly and easily. Learn how to create seamless app launch experiences when deep linking into content of UIKit or TVMLKit apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/710vxa4hl8hyb72/710/710_hd_core_ml_in_depth.mp4?dl=1", "title": "Core ML in depth", "summary": "Dive deeper into the details of the new Core ML framework. Explore how machine learning model development and app development fit together. Take a closer look at how models are represented and how models can be converted from popular machine learning and deep learning libraries, and learn about the performance optimizations Core ML does behind the scenes."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/239jf31ojfabtst2rm/239/239_hd_connecting_carekit_to_the_cloud.mp4?dl=1", "title": "Connecting CareKit to the Cloud", "summary": "The CareKit open source project provides customizable modules for delivering an app that puts a patient's care plan and adherence tracking in the palm of their hands. Connecting patient care apps to the care team is critical for monitoring adherence and providing updates is crucial. Until now, every implementation required custom integration.  Learn how the new CareKit Bridge API abstracts the communication to the back end and provides a simple mechanism for plugging in your custom or third-party provided cloud connectors."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/809dxbck5y8h8e1/809/809_hd_communication_between_designers_and_engineers.mp4?dl=1", "title": "Communication Between Designers and Engineers", "summary": "Good communication between designers and engineers is the key to building great products. Discover how production and specification techniques can improve communication, build trust, and help design and development teams work together to build better apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/227jjbmtoqrzj00/227/227_hd_data_delivery_with_drag_and_drop.mp4?dl=1", "title": "Data Delivery with Drag and Drop", "summary": "Drag and Drop is the front end of a simple concept: transferring data. Whether it is in app or between apps, this data transfer is backed by item providers. Learn how item providers work and how to implement your own providers to facilitate efficient data transfers from your App."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/220ugyk0ejmva/220/220_hd_customized_loading_in_wkwebview.mp4?dl=1", "title": "Customized Loading in WKWebView", "summary": "WKWebView allows you to seamlessly integrate web content into your app. Learn how new features in WKWebView allow you to manage cookies, filter unwanted content, and give you more control over loading web content."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/236m8wqo6pbcjnqm2k/236/236_hd_cocoa_development_tips.mp4?dl=1", "title": "Cocoa Development Tips", "summary": "Gain tips from seasoned framework engineers about how to get the most out of your Cocoa development efforts.  For example, find out how you can get perfect hashing behavior from NSDictionary with a simple API.  From best practices to lesser known APIs, there is something for everyone to learn."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/218p1ql8x8ga34/218/218_hd_choosing_the_right_cocoa_container_view.mp4?dl=1", "title": "Choosing the Right Cocoa Container View", "summary": "AppKit offers numerous ways to easily present your data. Join our framework engineers for a guided tour of versatile standard view classes you can put to work in your own macOS apps.  Hear about NSStackView, NSTableView, NSCollectionView, and other container views in AppKit.  Explore the interesting features and benefits of each, and examine real-world use cases to help you choose the most suitable building blocks for your apps' user interfaces."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/229pmdntyv1wd/229/229_hd_building_great_documentbased_apps_in_ios_11.mp4?dl=1", "title": "Building Great Document-based Apps in iOS 11", "summary": "Document based apps have never been better with the new consistent system-provided user interface for opening and creating documents. This session will go into detail of how your document based app can leverage this functionality to provide a great user experience. See how to customize the UI so it fits perfectly inside your app. Get details about making your documents look their best with the new QuickLook APIs for generating thumbnails and for showing custom previews of your own files formats."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/222ijxk2akkrebmr/222/222_hd_advanced_touch_bar.mp4?dl=1", "title": "Advanced Touch Bar", "summary": "Look behind the scenes into how system applications enhance their Touch Bar content with more than the basic controls. Learn about NSScrubber, customizing the text bar, candidate list item, event handling, layout, animations, and more. Leverage the full power of the Touch Bar to take your Mac app to the next level."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/818xw12wzot6au/818/818_hd_60_second_prototyping.mp4?dl=1", "title": "60 Second Prototyping", "summary": "Learn how to quickly build interactive prototypes! See how you can test new ideas and improve upon existing ones with minimal time investment and using tools you are already familiar with."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/708n9dvm3oden/708/708_hd_best_practices_and_whats_new_in_user_notifications.mp4?dl=1", "title": "Best Practices and What’s New in User Notifications", "summary": "Local and push notifications enable your app to keep users informed with timely and relevant content, by displaying messages and accepting users' actions, or playing distinctive sounds, or updating the badge on your app icon. Service extensions enable your app to decrypt and augment push notification content before being displayed. Find out what's new and get expert advice on implementing user notifications in your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/709e7ilkvrjhjr/709/709_hd_advances_in_networking_part_2.mp4?dl=1", "title": "Advances in Networking, Part 2", "summary": "Learn about important improvements to URLSession. Find out how to use new URLSession APIs to better handle connectivity fluctuations, to schedule background session tasks, and to receive progress reports for session tasks. Plus, gain insights into valuable best practices, tips, and news about ongoing work with emerging network technologies."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/707h2gkb95cx1l/707/707_hd_advances_in_networking_part_1.mp4?dl=1", "title": "Advances in Networking, Part 1", "summary": "Find out how Apple's networking libraries and frameworks are taking advantage of new and improved protocols to deliver better connectivity and performance for your apps. In this first of two sessions, we'll cover ECN, IPv6, Network Extensions, and Multipath protocols."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/238a3uic99uf9c6iw3/238/238_hd_writing_energy_efficient_apps.mp4?dl=1", "title": "Writing Energy Efficient Apps", "summary": "People expect long battery life on their mobile devices, and apps play a vital role in achieving that experience. Learn strategies to conserve energy while providing the best experience for your app. Find out about the key areas that affect energy consumption of an app as well as how to best use the available APIs to optimize battery life. Master energy debugging tools to make your app more energy efficient."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/411a7o9phe4uekm/411/411_hd_whats_new_in_llvm.mp4?dl=1", "title": "What's New in LLVM", "summary": "The Apple LLVM compiler in Xcode 9 has new language features, improved diagnostics, and more powerful optimizations. Keep up with the newest additions to Objective-C and C++, get an overview of new and improved warnings and static analyzer checks, and learn about how the LLVM compiler technology is delivering faster build times and better runtime performance for your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/212vz78e2gzl2/212/212_hd_whats_new_in_foundation.mp4?dl=1", "title": "What's New in Foundation", "summary": "Whether you're building apps for iOS, macOS, watchOS, or tvOS, a lot of the functionality you get from Apple's SDKs comes from the Foundation framework. Join the Foundation engineering team to hear about the improvements they've been working on. Learn how significant changes to key paths can help make your code safer with strong type checking in Swift. Hear all about how the new archiving API can help you safely convert your native Swift types to and from external formats like JSON.  Gain insights into performance enhancements that will help make your app even more efficient."},
{"url": null, "title": "WWDC 2017 Keynote", "summary": "WWDC 2017 Keynote"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/102xyar2647hak3e/102/102_hd_platforms_state_of_the_union.mp4?dl=1", "title": "Platforms State of the Union", "summary": "WWDC 2017 Platforms State of the Union"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/409cjm7echviyzl/409/409_hd_whats_new_in_testing.mp4?dl=1", "title": "What's New in Testing", "summary": "Xcode 9 has new APIs for structuring your test logging and including your own attachments and screenshots, as well as new support for parallel device and simulator testing. Learn how to write UI tests that target multiple applications, and find out ways to improve the performance of your UI tests."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/402ynph39nk5sn4222/402/402_hd_whats_new_in_swift.mp4?dl=1", "title": "What's New in Swift", "summary": "Swift 4 continues the evolution of the safe, fast, and expressive language, with better performance and new features. Learn about the new String and improved generics, see how Swift 4 maintains support for your existing Swift 3 code, and get insight into where Swift is headed in the future."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/407kc2s6vvx95/407/407_hd_understanding_undefined_behavior.mp4?dl=1", "title": "Understanding Undefined Behavior", "summary": "Undefined behavior in programming languages can introduce difficult to diagnose bugs and even lead to security vulnerabilities in your App. Learn more about undefined behavior, the tools available in Xcode 9 that address it, and why Swift is safer by design."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/607x3ix6ocbh8/607/607_hd_metal_2_optimization_and_debugging.mp4?dl=1", "title": "Metal 2 Optimization and Debugging", "summary": "Developing Metal 2-based apps is even easier with the redesigned tools for debugging and profiling in Xcode. Dive into the enhanced Metal Frame Debugger and explore techniques for fine-tuning graphics and compute workloads. Learn about accessing detailed GPU performance counters, and check out new support in Metal System Trace for optimizing VR apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/228b3suet75j9rt2n/228/228_hd_making_great_sirikit_experiences.mp4?dl=1", "title": "Making Great SiriKit Experiences", "summary": "People love Siri so it's essential to use SiriKit optimally for your app to provide a great Siri experience. Learn how to solve common pitfalls related to contact resolution, using Touch ID, and more. Find out how UI tests can benefit your SiriKit extension and how they can speed up the development process by automatically giving Siri text to process."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/416mytru0s49ohk/416/416_hd_teaching_with_swift_playgrounds.mp4?dl=1", "title": "Teaching with Swift Playgrounds", "summary": "Teaching can be difficult and teaching programming can be even harder — it's abstract and concrete at the same time, and you must help the learner build a mental model of what code really does. Find out how the Swift Playgrounds content team works through the teaching process, from idea to finished playground. We'll cover lessons learned building the Learn to Code series, and tips and methods we've developed to streamline our current workflow. Come away with valuable teaching insights and a great head start on building your own instructional content."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/511kmynuza/511/511_hd_safari_extensibility_content_blocking_and_shared_links.mp4?dl=1", "title": "Safari Extensibility: Content Blocking and Shared Links", "summary": "Safari in iOS 9 and OS X El Capitan delivers new ways for your app to extend Safari's behavior. Learn how to create Shared Links and Content Blocking extensions for iOS and OS X, and about changes to the Safari Extension development process."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/703kp2dwbwkr/703/703_hd_privacy_and_your_app.mp4?dl=1", "title": "Privacy and Your App", "summary": "Learn about new developments in Privacy in iOS, OS X, and watchOS that impact your apps. Hear about best practices for delivering great features and respecting your customers' privacy."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/812be3ra1bugc3w/812/812_hd_size_classes_and_core_components.mp4?dl=1", "title": "Size Classes and Core Components", "summary": "Designing for multiple screen sizes can seem complicated, difficult, and time-consuming. Learn how size classes, dynamic type, and UIKit elements help your app to scale elegantly, save you time, and make your app look amazing on whatever device people are using."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/706byvveyendgv5l/706/706_hd_modernizing_grand_central_dispatch_usage.mp4?dl=1", "title": "Modernizing Grand Central Dispatch Usage", "summary": "macOS 10.13 and iOS 11 have reinvented how Grand Central Dispatch and the Darwin kernel collaborate, enabling your applications to run concurrent workloads more efficiently. Learn how to modernize your code to take advantage of these improvements and make optimal use of hardware resources."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/222ngkqh58b52/222/222_hd_new_uikit_support_for_international_user_interfaces.mp4?dl=1", "title": "New UIKit Support for International User Interfaces", "summary": "iOS 9 brings complete right-to-left support for Arabic, Hebrew, and other languages.  Going beyond basic text, your app's entire interface can now flip to provide a native right-to-left experience. Learn what behavior you get for free from UIKit, and hear details about adding right-to-left support in custom interfaces.  Hear from experts about how to evaluate the readiness of your app for these languages.  Understand best practices to avoid common pitfalls and to create a seamless bi-directional app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/711y6zlz0ll/711/711_hd_networking_with_nsurlsession.mp4?dl=1", "title": "Networking with NSURLSession", "summary": "Learn about App Transport Security, HTTP/2 protocol support, new NSURLSession API, and best practices for networking in apps, extensions, and WatchKit apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/223rmo6dv9hxh/223/223_hd_introducing_the_contacts_framework_for_ios_and_os_x.mp4?dl=1", "title": "Introducing the Contacts Framework for iOS and OS X", "summary": "Whether it's getting contact information, managing a social graph, or adding a new friend, Contacts are a critical piece of many apps. OS X El Capitan and iOS 9 now share a new Contacts API. Understand the design, goals, and benefits of this new framework. Gain critical insights into how to make a smooth transition for your app to this new framework."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/105ncyldc6ofunvsgtan/105/105_hd_introducing_watchkit_for_watchos_2.mp4?dl=1", "title": "Introducing WatchKit for watchOS 2", "summary": "WatchKit for watchOS 2 introduces many new capabilities for creating responsive Watch experiences. Beyond a faster architecture, learn about all new support for the Digital Crown, fluid animations, and media playback and recording. Find out how to make use of accelerometer and heart rate data, as well as providing physical feedback via the Taptic Engine."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/713gc2tqvvb/713/713_hd_introducing_watch_connectivity.mp4?dl=1", "title": "Introducing Watch Connectivity", "summary": "Getting information to your Watch app is crucial. Learn how to leverage NSURLSession to get your data from the Internet. Tap into the new WatchConnectivity framework for device to device communication and transferring of data. See real-world examples and learn best practices to understand when to use your WatchKit extension and when to leverage your iPhone app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/709jcaer6su/709/709_hd_introducing_search_apis.mp4?dl=1", "title": "Introducing Search APIs", "summary": "Making your app more discoverable leads to more downloads and generates revenue. iOS 9 adds a variety of ways to surface the rich content in your app making search results more relevant.  Understand how you can enhance search results with App History and CoreSpotlight.  See how small changes on your website can produce better Safari suggestions.  Gain insights into how deep app links can bring people directly where they want to go in your app, making your app's content even more discoverable and searchable than content on the traditional web."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/5048tyhotl6/504/504_hd_introducing_safari_view_controller.mp4?dl=1", "title": "Introducing Safari View Controller", "summary": "The new SFSafariViewController class enables you to deliver interactive web content in your app just like Safari, including the key Safari UI elements already familiar to your users. See how to easily bring Safari features like Reader and AutoFill into your app, and provide a great web viewing experience with fewer lines of code."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/22160ycymy0qg/221/221_hd_improving_the_full_screen_window_experience.mp4?dl=1", "title": "Improving the Full Screen Window Experience", "summary": "Full screen windows enable people to focus on the task at hand by removing extra system UI and deferring to more of the content they care about. OS X 10.11 adds new flexibility to how these full screen windows can be configured and controlled. Hear from the experts how to get your Mac app ready to take advantage of this new functionality. Learn key strategies to making your window content be adaptive depending on the space available."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/2058z3fx76huw93/205/205_hd_getting_started_with_multitasking_on_ipad_in_ios_9.mp4?dl=1", "title": "Getting Started with Multitasking on iPad in iOS 9", "summary": "iOS 9 on iPad introduces the ability to view and interact with more than one app at a time. Discover how to update your code to take advantage of enhancements to multitasking and how to participate in Slide Over and Split View. Learn specifics about how to architect your app and understand best practices for adapting to a dynamically sized interface."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/803q4kw6eqia7ssp17/803/803_hd_designing_with_animation.mp4?dl=1", "title": "Designing with Animation", "summary": "Animation is a powerful tool for creating a delightful and intuitive app experience. We will show you how to get started with animations, how to make them effective for your user interface, and how to save time coding by building animations into interactive prototypes."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/801auxyvb1pgtkufjk/801/801_hd_designing_for_future_hardware.mp4?dl=1", "title": "Designing for Future Hardware", "summary": "Design for tomorrow's products today. See examples of how Apple and partners designed software for Apple Watch and other products before they even existed. Learn techniques for designing and prototyping so you can create great apps for hardware accessories and new products before they are available."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/802mpzd3nzovlygpbg/802/802_hd_designing_for_apple_watch.mp4?dl=1", "title": "Designing for Apple Watch", "summary": "Apple Watch represents a new chapter in the way people relate to technology. It's the most personal device Apple has ever designed, and it enables new ways to receive information and to interact with apps. Learn about the foundations on which Apple Watch was designed and how they lead to Apple Watch apps that complement the iPhone, support lightweight interaction and deliver timely and relevant information to the wrist. Discover how to create usable and beautiful apps, notifications and glances through effective use of typography, information design, layout, animation, and color."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/209c9277tttlt9/209/209_hd_creating_complications_with_clockkit.mp4?dl=1", "title": "Creating Complications with ClockKit", "summary": "Making your app's information available to users on Apple Watch is even easier in watchOS 2. Learn how to create custom complications for Watch faces using the new ClockKit framework and see how to provide data through numerous templates using text and images."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/2313dt427pmq/231/231_hd_cocoa_touch_best_practices.mp4?dl=1", "title": "Cocoa Touch Best Practices", "summary": "Small improvements can make a big impact on your iOS app's performance and launch time. Learn best practices to optimize your UIKit-based applications. See how to future-proof your app for what may be next, and walk through numerous real world examples for more responsive and dynamic collection and table views."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/7153rwmu2r/715/715_hd_cloudkit_tips_and_tricks.mp4?dl=1", "title": "CloudKit Tips and Tricks", "summary": "CloudKit makes it easy to store and retrieve any kind of data from iCloud. Dive into the API with the CloudKit framework team as they explore some of its lesser-known features, explore best practices around subscriptions and queries, and reveal its hidden gems."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/710jle9eakx/710/710_hd_cloudkit_js_and_web_services.mp4?dl=1", "title": "CloudKit JS and Web Services", "summary": "CloudKit.js is the new library that provides web access to your app data stored in iCloud. Explore the new web service APIs and learn how to extend your iOS or OS X apps to the web using CloudKit."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/1086gvs7f4vryixs49s6/108/108_hd_building_watch_apps.mp4?dl=1", "title": "Building Watch Apps", "summary": "Building Watch apps with Xcode 7 is easy and straight-forward. Learn how to build and debug a Watch app for watchOS 2 from the ground up. Walk through adding a Watch app to an existing application, building the user interface, debugging and profiling with Instruments, and discover how to efficiently communicate between iPhone and Apple Watch."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/224o6pqmtb4ik/224/224_hd_app_extension_best_practices.mp4?dl=1", "title": "App Extension Best Practices", "summary": "App extensions allow powerful ways to expose your application's abilities throughout iOS and other apps. Discover best practices for various extension types and see how to effectively communicate between your extension and its parent application or the network. Learn techniques for using the shared keychain and see how to improve discovery of your share and action extensions."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/234reaz1byqc/234/234_hd_building_document_based_apps.mp4?dl=1", "title": "Building Document Based Apps", "summary": "UIDocument is a robust way to model user-generated content in your app. See how to easily integrate your app's documents with iCloud, file extensions, and document browsers. Learn how to build a document-based app from the ground up."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/213w6grumlfm0q/213/213_hd_building_apps_with_researchkit.mp4?dl=1", "title": "Building Apps with ResearchKit", "summary": "ResearchKit is an open source framework introduced by Apple that allows researchers and developers to create powerful apps for medical research. Learn how to easily create visual consent flows, real-time dynamic active tasks, and surveys using a variety of customizable modules that you can build upon and share with the community."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/232f1zopzycv/232/232_hd_best_practices_for_progress_reporting.mp4?dl=1", "title": "Best Practices for Progress Reporting", "summary": "NSProgress lets you easily and accurately report the progress of work in your app. Understand the concepts behind progress reporting and how to design code that accurately and efficiently reports its progress. Gain specific insights on how to receive progress updates from framework APIs, fold that into your own progress reporting, and show that progress in your app. Hear from the experts about best practices and how to master the NSProgress APIs."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/1026npwuy2crj2xyuq11/102/102_hd_platforms_state_of_the_union.mp4?dl=1", "title": "Platforms State of the Union", "summary": "WWDC 2015 Platforms State of the Union"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/1014o78qhj07pbfxt9g7/101/101_hd_keynote.mp4?dl=1", "title": "Keynote", "summary": "WWDC 2015 Keynote"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/242vdhuk4hmwrxnb465/242/242_hd_whats_new_in_core_data.mp4?dl=1", "title": "What's New in Core Data", "summary": "Core Data is a framework that you can use to manage the model layer objects in your application, providing generalized and automated solutions to common tasks associated with object life cycle, object graph management, and persistence. Learn about the latest advancements in and explore best practices for taking full advantage of this powerful framework."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/205n2okotvilcayc8rc/205/205_hd_whats_new_in_cocoa_touch.mp4?dl=1", "title": "What's New in Cocoa Touch", "summary": "The UIKit framework provides the crucial infrastructure needed to construct and manage iOS apps, and UIKit continues to advance the state of the art for app design with many new features. Dive straight into new features across the iOS frameworks that allow your apps to take advantage of many new system services, as well as to offer services to other apps. This is your first stop to discover the many sessions to see about harnessing the power of iOS 10."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/805yjy11epjkgmnn11/805/805_hd_apple_watch_design_tips_and_tricks.mp4?dl=1", "title": "Apple Watch Design Tips and Tricks", "summary": "Get essential design guidance for creating Apple Watch apps that support quick and efficient interaction, make accessing features and information more convenient, and compliment their companion iOS apps. Learn key tips about information architecture, layout, typography, color and app icon design that will make your app easy to use, beautiful and delightful."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/104usewvb5m0qbwafx8p/104/104_hd_whats_new_in_xcode.mp4?dl=1", "title": "What's New in Xcode", "summary": "Xcode is the development environment for creating great apps for Apple's platforms. Start the week by watching the Xcode team demonstrate the latest features and improved workflows in Xcode 7. This session also provides a complete overview of the in-depth developer tools topics covered at WWDC 2015."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/203x2w42att1kdzg1ce/203/203_hd_whats_new_in_cocoa.mp4?dl=1", "title": "What's New in Cocoa", "summary": "macOS brings many new enhancements such as automatic window tabbing, enhanced color reproduction, and improved presentation of right-to-left languages. Get introduced to new APIs for these features and more, such as NSGridView and NSMeasurement. Learn about new conventions for APIs in Swift and Objective-C. This is your first stop to discover exciting new features in Cocoa sessions throughout the week."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/702lp563ezbr/702/702_hd_apple_pay_within_apps.mp4?dl=1", "title": "Apple Pay Within Apps", "summary": "Apple Pay is the easy, secure, and private way to pay for physical goods and services within apps on iPhone 6, iPad Air 2, and iPad mini 3. Find out how you can increase conversion rates in your checkout experience by integrating with Apple Pay APIs. And learn more about what's new with Apple Pay within apps in iOS 9."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/508nbofuzf16hljuwqe/508/508_hd_using_apple_news_format_to_create_rich_and_responsive_stories.mp4?dl=1", "title": "Using Apple News Format to Create Rich and Responsive Stories", "summary": "Apple News beautifully introduces new readers to your stories. Learn about Apple News Format and how it can be used to author rich, responsive stories that intelligently adapt to all screen sizes. Discover the many features of Apple News including interactive galleries, video, audio, and animations which help to make your content more engaging than ever."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/211m4cro5y3rrsfzfdj/211/211_hd_quick_interaction_techniques_for_watchos.mp4?dl=1", "title": "Quick Interaction Techniques for watchOS", "summary": "Quick interactions are essential for creating a compelling Apple Watch app. Gain insights into new gesture, Digital Crown, navigation, and notification APIs, and see how to use these API alongside SceneKit and SpriteKit to create rich, glanceable interfaces. Explore how this expanded toolbox can help make your watch apps quick and responsive."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/241fgk9sdmxcb6c6wz2/241/241_hd_public_transit_in_apple_maps.mp4?dl=1", "title": "Public Transit in Apple Maps", "summary": "Launched last year with iOS 9 and macOS El Capitan, the new Transit feature in Apple Maps is customized for each city where it's available. Hear about how the Apple Maps team ensures a great customer experience through a combination of transit agency data, field survey, and close attention to the unique transit culture of each city. If you're a transit agency, learn about how you can help to ensure your customers have the most reliable information in Apple Maps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/420lbx5afix4io0xo9p/420/420_hd_optimizing_web_content_in_your_app.mp4?dl=1", "title": "Optimizing Web Content in Your App", "summary": "The Web Inspector provides some sleek new tools to help you understand your app's web content performance and memory usage. Explore how you can use Web Inspector's new memory and JavaScript profiling tools to debug web content on iOS and macOS. Discover new features and learn best practices to maximize your effectiveness with the Web Inspector tools."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/714urluxe140lardrb7/714/714_hd_networking_for_the_modern_internet.mp4?dl=1", "title": "Networking for the Modern Internet", "summary": "The next wave of the Internet's evolution is happening now. You'll learn best practices for supporting IPv6, restricting cellular usage, and using Quality of Service to create a fast lane for your iOS apps. Discover how to support a multilingual Internet by using UTF-8, and how new internationalized domain names and email addresses affect you."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/711tlraheg74mofg3uq/711/711_hd_nsurlsession_new_features_and_best_practices.mp4?dl=1", "title": "NSURLSession: New Features and Best Practices", "summary": "NSURLSession provides a rich set of methods to support uploading and downloading content via HTTP and newer HTTP-based protocols, authentication with web servers, local caching of resources, and transfers that occur in the background while your app isn't running — simplifying the complexities of modern day networking. Learn about new enhancements in HTTP/2, introspection capabilities with networking metrics, and security and privacy enhancements for you and your customers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/221l723gdmjyvv5pmw7/221/221_hd_optimizing_ondemand_resources.mp4?dl=1", "title": "Optimizing On-Demand Resources", "summary": "Using On-Demand Resources allows you to create smaller app bundles, enable faster downloads, and add more content than ever before on iOS and tvOS. Learn the recommended approach for delivering apps packaged with On-Demand Resources. Explore strategies for pre-fetching content and understand how to optimize the first-launch experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/238eemv232k9lp2px30/238/238_hd_measurements_and_units.mp4?dl=1", "title": "Measurements and Units", "summary": "The Foundation framework, which includes the root object class, classes representing basic data types such as strings and byte arrays, and collection classes for storing other objects, has added new support for specifying Units and Measurements. Understand how to model your measurements and convert within dimensions. Learn from the experts how to use and surface Units and Measurements in your interfaces."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/210e4481b1cnwor4n1q/210/210_hd_mastering_uikit_on_tvos.mp4?dl=1", "title": "Mastering UIKit on tvOS", "summary": "Learn how to make your tvOS interface more dynamic, intuitive, and high-performing with tips and tricks learned in this session."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/223j90dqr7q1xyld1mv/223/223_hd_making_the_most_of_search_apis.mp4?dl=1", "title": "Making the Most of Search APIs", "summary": "Search APIs make it easy for users to discover information in your app and the app itself. New features expand the search capabilities allowing users to search directly in your app and enable you to search your own app index. Learn about the latest API updates and the new privacy-friendly method for improving the ranking of your app content."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/233c3uhytv8cxwoanja/233/233_hd_making_apps_adaptive_part_2.mp4?dl=1", "title": "Making Apps Adaptive, Part 2", "summary": "In this second part of a two part series, go beyond the basics in understanding how to make your apps adaptive. Learn through practical examples how to extend your application interfaces using UIKit. Get introduced to best practices for structuring your app for flexible interface designs. Learn from the experts what to keep in mind as you build apps for the future, today."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/220c6lnr7wkcjewnj1g/220/220_hd_leveraging_touch_input_on_ios.mp4?dl=1", "title": "Leveraging Touch Input on iOS", "summary": "Learn essential best practices for using event input from Apple Pencil in your drawing apps. Gain a practical understanding of the concepts behind efficient and accurate touch event processing. Get details about the touch input pipeline on iOS and how to take advantage of it in all your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/805zlxpfexwwzt7x0cr/805/805_hd_iterative_ui_design.mp4?dl=1", "title": "Iterative UI Design", "summary": "You're familiar with Keynote for making presentations, but it's also a powerful tool for exploring, iterating and refining user interface layouts and workflows. Learn techniques and best practices for using Keynote to quickly and persuasively express your product ideas by building realistic and tangible design comps and user flows."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/707s77u9e6pv0dy9ggm/707/707_hd_introduction_to_notifications.mp4?dl=1", "title": "Introduction to Notifications", "summary": "Push and locally scheduled notifications can provide people with timely information and provide them with the ability to take appropriate actions in response. Hear about the new APIs to schedule, respond to, and manage delivery of notifications. Learn how to write an extension to decrypt and augment push notifications before they are displayed."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/217x5143f51ztsxao1u/217/217_hd_introducing_sirikit.mp4?dl=1", "title": "Introducing SiriKit", "summary": "iOS 10 introduces SiriKit, a new framework enabling apps to integrate with Siri. Simply by speaking, your apps can send messages, place calls, send payments, and more. Learn how SiriKit helps you create new experiences on iOS and explore design principles for creating a great Siri experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/218e59uvbkp1smncrss/218/218_hd_keeping_your_watch_app_up_to_date.mp4?dl=1", "title": "Keeping Your Watch App Up to Date", "summary": "Keeping your Apple Watch app up to date is key to creating a great experience on watchOS 3. Learn how to use the new background tasks to keep your complications and the new watchOS 3 Dock snapshots consistent with your app's underlying model. Discover how to get the most from NSURLSessions and Watch Connectivity to keep data fresh and glanceable."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/701q0pnn0ietcautcrv/701/701_hd_introducing_apple_file_system.mp4?dl=1", "title": "Introducing Apple File System", "summary": "The Apple File System (APFS) is the next-generation file system designed to scale from an Apple Watch to a Mac Pro. APFS is optimized for Flash/SSD storage, and engineered with encryption as a primary feature. Learn about APFS benefits versus HFS+ and how to make sure your file system code is compatible."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/201h1g4asm31ti2l9n1/201/201_hd_internationalization_best_practices.mp4?dl=1", "title": "Internationalization Best Practices", "summary": "Following some simple practices when writing your app can help make it world-ready. Learn about what's new, how to take greater advantage of existing frameworks, and review some common pitfalls and how to avoid them. Hear some ideas for going one step further and optimizing your app for different countries."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/240f49ca5uvbzg5pwk5/240/240_hd_increase_usage_of_your_app_with_proactive_suggestions.mp4?dl=1", "title": "Increase Usage of Your App With Proactive Suggestions", "summary": "iOS and macOS can proactively promote your app and data, thereby increasing user engagement. See how adopting a few simple APIs to inform the OS about your app's capabilities can lead to your app being suggested in various places like the app switcher, on the lock screen, Contacts, and more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/801y753jw8vxmjblocq/801/801_hd_inclusive_app_design.mp4?dl=1", "title": "Inclusive App Design", "summary": "Inclusive design means making your app intuitive, appropriate, and delightful for a global audience and people who have accessibility challenges. Learn easy-to-follow techniques for making your app culturally-relevant and accessible through use of type, layout, color and iconography."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/705s57mrvm8so193i8c/705/705_hd_how_ios_security_really_works.mp4?dl=1", "title": "How iOS Security Really Works", "summary": "Have you saved our 63-page iOS security white paper to your Reading List but find yourself too busy making great apps to get through it? You can keep your good intentions to devour every last detail, but meanwhile come join us for an illuminating talk on why we care so deeply about security as a design philosophy central to all our iOS products."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/209e37d5ks3pfj21ij5/209/209_hd_getting_the_most_out_of_healthkit.mp4?dl=1", "title": "Getting the Most Out of HealthKit", "summary": "HealthKit offers more than ever to developers joining in Apple's vibrant health and fitness ecosystem. Discover new ways to integrate the popular activity-tracking features of Apple Watch with your own app. Learn how to contribute to an even more complete picture of users' health data by reading and writing Health Documents from your organization. Review core concepts for working with HealthKit and explore best practices for managing data to ensure your users enjoy a seamless experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/237e12rha4rg2t0p53u/237/237_hd_getting_started_with_carekit.mp4?dl=1", "title": "Getting Started with CareKit", "summary": "CareKit is a new open source framework designed to help you create personal care apps that can monitor, present and share personal health information. Learn how to create and extend Care Cards and an Insight Dashboard, and to package information for sharing with families or professional caregivers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/502lezynlddsti4drbq/502/502_hd_getting_published_in_apple_news.mp4?dl=1", "title": "Getting Published in Apple News", "summary": "Become a News Publisher. Apple News allows you to monetize your stories and find new readers. Learn how to sign up and discover how easy it is to integrate with your existing CMS or author stories using the News Publisher authoring tool."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/410ozg0v8cc7h/410/410_hd_localizing_content_for_swift_playgrounds.mp4?dl=1", "title": "Localizing Content for Swift Playgrounds", "summary": "Localizing a playground book is more than just translation. Explore best practices, potential problem areas, and the unique challenges of localizing educational content. Understand how a localized playground book is structured and hear about the lessons learned by the people who made it happen."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/815hn3cbczzv55/815/815_hd_how_to_pick_a_custom_font.mp4?dl=1", "title": "How to Pick a Custom Font", "summary": "Choosing a custom font for your app can be a daunting task involving both functional and stylistic decisions. Gain a solid understanding of fundamental font design characteristics such as proportion and contrast. Learn how to apply this knowledge when deciding which font is right for your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/405jj1fb4x5ol/405/405_hd_github_and_the_new_source_control_workflows_in_xcode_9.mp4?dl=1", "title": "GitHub and the New Source Control Workflows in Xcode 9", "summary": "Learn about the new tools in Xcode 9 for exploring the source control history of your projects. See how Xcode integrates with GitHub, and discover how the new source control navigator makes it easy to browse branches, tags, and detailed history and commit information."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/406hi7pbvl7ez0j/406/406_hd_finding_bugs_using_xcode_runtime_tools.mp4?dl=1", "title": "Finding Bugs Using Xcode Runtime Tools", "summary": "Learn how to use Xcode 9 runtime tools to help find issues and bugs, ranging from missing and unintended UI updates to integer overflows and data races on collection APIs.  Hear about the new Undefined Behavior Sanitizer and Main Thread Checker runtime tools in Xcode 9, and the improvements to Address and Thread Sanitizers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/414qr3121b1oieq/414/414_hd_engineering_for_testability.mp4?dl=1", "title": "Engineering for Testability", "summary": "Unit testing is an essential tool to consistently verify your code works correctly. Discover techniques for designing the code of your app so that it can be easily tested. Find out the best practices for developing a test suite that evolves with your app and scales as your app grows."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/244ogyk0iqlop3ecdr/244/244_hd_efficient_interactions_with_frameworks.mp4?dl=1", "title": "Efficient Interactions with Frameworks", "summary": "Border crossings can be smooth and efficient or slow and tedious. The boundary between an app and a framework is analogous, but inefficiencies may not always be obvious. Whether it's passing data to an API or understanding how to stay on the fast path while rendering text, we'll explore various aspects of how an app can work efficiently with underlying frameworks. If you build your own frameworks, gain valuable insights into how your clients can be as efficient as possible."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/404z7uj3xincdb0/404/404_hd_debugging_with_xcode_9.mp4?dl=1", "title": "Debugging with Xcode 9", "summary": "Xcode 9 introduces wireless development for iOS and tvOS. Discover how to configure and use wireless development with your devices. Learn about Xcode's latest debugging features — including debugging workflow enhancements, and new view debugging support for view controllers, SpriteKit and SceneKit — now with no strings attached."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/226hm9uasv2xilo/226/226_hd_build_better_apps_with_cloudkit_dashboard.mp4?dl=1", "title": "Build Better Apps with CloudKit Dashboard", "summary": "The CloudKit Dashboard has been completely overhauled to aid you throughout your development lifecycle of building, testing, operating, and supporting your CloudKit-backed applications. See the new functionality, including fetching changes and modifying sharing relationships right from the Dashboard.  Gain insights from real-time server logs into events across all of your users—including CloudKit push notifications—to facilitate debugging and customer support."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/412icy0vh6ays/412/412_hd_auto_layout_techniques_in_interface_builder.mp4?dl=1", "title": "Auto Layout Techniques in Interface Builder", "summary": "Auto Layout enables you to easily create robust layouts for your apps. Hear details about new and existing techniques for building layouts in Interface Builder. Learn how to build more dynamic layouts and handle state changes using priorities and size classes. Find out how iOS 11 support for dynamic type and safe areas can ensure your content can be viewed by anyone."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/413fmx92zo14voet8/413/413_hd_app_startup_time_past_present_and_future.mp4?dl=1", "title": "App Startup Time: Past, Present, and Future", "summary": "Learn about the dyld dynamic linker used on Apple platforms, how it's changed over the years, and where it's headed next. Find out how improved tooling makes it easier to optimize your app's launch time, and see how new changes coming in dyld will bring even further launch time improvements."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/822qxyzd1qk9l222/822/822_hd_app_icon_design.mp4?dl=1", "title": "App Icon Design", "summary": "An app icon is the face of your app on the home screen. Learn key design principles for creating simple, unique, meaningful and beautiful app icons. Gain simple but effective techniques for testing your app icon for clarity and immediate recognizability."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/202ximbb9e2dq222/202/202_hd_advances_in_tvmlkit.mp4?dl=1", "title": "Advances in TVMLKit", "summary": "TVMLKit allows you to quickly build native tvOS apps that are backed by XML templates and JavaScript logic. Take your TVMLKit apps even further with new tvOS 11 technologies and features. Learn about Right-to-Left support, performance optimizations, significant enhancements to Web Inspector, and much more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/711d9xpgp3203tlq/711/711_hd_accelerate_and_sparse_solvers.mp4?dl=1", "title": "Accelerate and Sparse Solvers", "summary": "Learn about Sparse Matrix Solvers in the Accelerate framework. In addition, find out how Accelerate's Basic Neural Network Subroutines (BNNS), vDSP, simd and other subframeworks give you fast, energy-efficient signal and image processing and handle large-scale mathematical computations."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/110agzs7njnnjtee/110/110_hd_convenience_for_you_is_independence_for_me.mp4?dl=1", "title": "Convenience for You is Independence for Me", "summary": "Why design apps with accessibility?  Meet Todd Stabelfeldt, founder of C4 Consulting, who has lived with quadriplegia since the age of 8.  Over his decades-long struggle for increased independence in both his personal and professional lives, Todd has become a noted expert in technologies for persons with disabilities, which he has found can offer not only a level of autonomy but also empowerment and dignity to the mobility impaired.  Leading by example, Todd runs a successful business but his real passion lies elsewhere.  Hear how apps designed well with accessibility in mind have changed his life as a husband, father and as owner of the “Quadthedral“, his family's HomeKit-enabled smart home."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/716op0un8kq3o4n/716/716_hd_ios_configuration_and_apis_for_kiosk_and_assessment_apps.mp4?dl=1", "title": "iOS Configuration and APIs for Kiosk and Assessment Apps", "summary": "iOS provides several techniques for keeping your app front and center. Whether you're building a kiosk, hospitality check-in, or educational assessment app, choosing the right app-lock technique is critical. From Guided Access to Automatic Assessment Configuration you'll learn which approach works best for your unique experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/302gfkat3b267/302/302_hd_whats_new_in_itunes_connect.mp4?dl=1", "title": "What's New in iTunes Connect", "summary": "iTunes Connect has been updated to make the experience of delivering your app to the new App Store even better. Learn about new and updated meta-data requirements, capabilities to support promotion of in-app purchases and techniques for handling customer reviews. Discover how new TestFlight features and deployment options can help you test and deploy your next masterpiece."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/303f0u5froddl13/303/303_hd_whats_new_in_storekit.mp4?dl=1", "title": "What's New in StoreKit", "summary": "Starting with an expert guide to implementing the In-App Purchase workflow, learn about Promoted In-App Purchases and how to use the new StoreKit APIs. Find out what's involved for your server and apps. And finally, get the details and guidance on asking for Ratings and Reviews, and responding to Reviews."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/403yv29uwyamwsi222/403/403_hd_whats_new_in_signing_for_xcode_and_xcode_server.mp4?dl=1", "title": "What's New in Signing for Xcode and Xcode Server", "summary": "Learn about new advances in Xcode's support for code signing, including more powerful distribution signing, better integration with Xcode Server, and more control for working with manual signing assets."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/304jud27ysms3xno/304/304_hd_whats_new_in_device_configuration_deployment_and_management.mp4?dl=1", "title": "What's New in Device Configuration, Deployment, and Management", "summary": "Platform features and tools make it easy to configure, deploy and manage Apple devices in organizations of all sizes. Discover new and updated configuration capabilities for each platform, updated app deployment techniques and tool changes that make low-bandwidth updates more accessible. Learn how educational institutions can use the advancements in Apple School Manager and Classroom to make configuring student devices even easier."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/215avg3cuo2bu/215/215_hd_whats_new_in_accessibility.mp4?dl=1", "title": "What's New in Accessibility", "summary": "Discover what's new in accessibility in iOS, watchOS, macOS, and tvOS.  Learn how to audit an App for accessibility, and take advantage of new assistive features.  Topics include how to best customize how Voice Over describes an App UI to the user, how to enhance the accessibility user experience with new features like Drag and Drop, and how to take advantage of sophisticated accessibility APIs to solve common issues."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/217m6q9g9wx6olr/217/217_hd_media_and_gaming_accessibility.mp4?dl=1", "title": "Media and Gaming Accessibility", "summary": "As a game developer, you may know your game like the back of your hand, but could you play it with your eyes closed? Apple devices come standard with award-winning accessibility features that let people with disabilities experience everything Mac, iPhone, iPad, Apple Watch, and Apple TV have to offer. Media apps and games require specific considerations and approaches to allow for all people to engage fully with your content. Gain deep insights into the key approaches and technologies to make your apps seamlessly functional for a broad range of users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/301nfvhdbpifiun/301/301_hd_introducing_the_new_app_store.mp4?dl=1", "title": "Introducing the New App Store", "summary": "Redesigned from the ground up, the new App Store provides a fresh approach to marketing your app.  Learn how the new functionality, enhanced editorial features, and the thinking that drove the visual changes are all designed to make your apps and in-app purchase more discoverable and appealing to your customers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/240nyzp1eit4xt84w4/240/240_hd_introducing_business_chat.mp4?dl=1", "title": "Introducing Business Chat", "summary": "Business Chat is a powerful new way for your customers to get answers to their questions, learn about and purchase your products, and engage with your existing support channels. Integrated into Messages and discoverable through Maps, Siri, Search, as well as your own app and website, Business Chat helps you build persistent, long-lasting relationships with your customers. See how to leverage built-in features like Apple Pay or calendar integration, as well as your own iMessage app in the conversation. Understand how to get started with Business Chat Developer Preview today."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/814w4jr9s0yp3cym8222/814/814_hd_designing_for_subscription_success.mp4?dl=1", "title": "Designing for Subscription Success", "summary": "Providing a great user experience can make it easier to acquire new subscribers. Get insights into effectively communicating the value of your subscriptions, streamlining the sign up flow, and providing a positive and effortless subscription experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/245ti8oovkx1hl5005/245/245_hd_building_apps_with_dynamic_type.mp4?dl=1", "title": "Building Apps with Dynamic Type", "summary": "With Dynamic Type, people choose their preferred text size and iOS switches fonts automatically as needed. Understand why Dynamic Type is important and how to support it when displaying text. Learn what's new in iOS 11, and master the frameworks and tools that make it easy to support Dynamic Type in your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/106z3yjwpfymnauri96m/106/106_hd_whats_new_in_swift.mp4?dl=1", "title": "What's New in Swift", "summary": "Swift continues its rapid advancement with version 2. New optimizations make your app run even faster, and new syntax makes your code more expressive. Learn about powerful new features like error handling, testability, and availability checking. This session will help you write even better apps by moving to Swift 2."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/215972d0hjjcfx/215/215_hd_whats_new_in_storyboards.mp4?dl=1", "title": "What's New in Storyboards", "summary": "Storyboards are a great way to build the user interface and flow of your application on iOS and OS X. Gain an understanding of how to effectively organize your storyboards, define segues for your interface, and easily unwind transitions. Dive into a detailed discussion of the new APIs, and hear tips on how to create great user interfaces."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/402c0mhxbs8tt52t/402/402_hd_whats_new_in_lldb.mp4?dl=1", "title": "What's New in LLDB", "summary": "Enhancements to LLDB simplify life for Swift and Objective-C developers alike. Experienced developers will find new powers within the debugging console, and learn more about the connection between the debugger and Swift REPL. Newcomers will get insight into the range of possibilities hidden behind the LLDB prompt."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/228eahxjbaops/228/228_hd_watchkit_tips_and_tricks.mp4?dl=1", "title": "WatchKit Tips and Tricks", "summary": "Apple Watch apps should load quickly and be responsive to users. Learn tips and tricks for optimizing your existing apps and gain insights specific to communicating between Apple Watch and iPhone, creating responsive layouts, decreasing loading times, and more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/406o0doszwo8r15m/406/406_hd_ui_testing_in_xcode.mp4?dl=1", "title": "UI Testing in Xcode", "summary": "Xcode 7 introduces new UI testing features fully integrated into the IDE. Learn about the new APIs and how UI testing fits in with existing testing features in Xcode. See how to get started by recording your app, and how to efficiently craft and maintain UI tests."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/4119flfsnsgmlfy/411/411_hd_swift_in_practice.mp4?dl=1", "title": "Swift in Practice", "summary": "Learn how Swift can help you define away some common pitfalls in app development, allowing your apps to benefit from safer runtime behavior while enjoying strong guarantees provided by Swift at compile-time. Hear about how API availability checking in Swift allows you to easily take advantage of new APIs while guaranteeing safe deployment to earlier OS releases. See how enumerations and protocols can help not only maintain compile-time invariants between your app's code and assets but also reduce boilerplate."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/401gee20yy5v2men/401/401_hd_swift_and_objectivec_interoperability.mp4?dl=1", "title": "Swift and Objective-C Interoperability", "summary": "Discover new features that make it easier than ever to craft Objective-C APIs that work beautifully in Swift, as well as new Swift language features that provide even better interoperability. Apple engineers will also discuss enhancements to Apple's SDKs that improve the Swift experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/408509vyudbqvts/408/408_hd_protocoloriented_programming_in_swift.mp4?dl=1", "title": "Protocol-Oriented Programming in Swift", "summary": "At the heart of Swift's design are two incredibly powerful ideas: protocol-oriented programming and first class value semantics. Each of these concepts benefit predictability, performance, and productivity, but together they can change the way we think about programming. Find out how you can apply these ideas to improve the code you write."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/412rhea5amj6iaf/412/412_hd_profiling_in_depth.mp4?dl=1", "title": "Profiling in Depth", "summary": "Learn about time profiling down to the disassembly level to help you investigate the minute details of your application that affect its performance and responsiveness."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/4097c25o0qhs6g5/409/409_hd_optimizing_swift_performance.mp4?dl=1", "title": "Optimizing Swift Performance", "summary": "Hear from the experts about how you can write faster Swift code and use Instruments to identify performance bottlenecks. Dive deep into specific techniques that will help you produce the most efficient code possible."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/403l7ohdidhmnkgx/403/403_hd_improving_your_existing_apps_with_swift.mp4?dl=1", "title": "Improving Your Existing Apps with Swift", "summary": "See how you can incrementally add Swift into your existing Objective-C codebase and app development workflow. Learn how to leverage Swift's powerful language features to develop robust applications that are faster to write and easier to maintain."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/4072909wwb9o9j3/407/407_hd_implementing_ui_designs_in_interface_builder.mp4?dl=1", "title": "Implementing UI Designs in Interface Builder", "summary": "Apps that stand out must be attractive, intuitive, and easy to use. Interface Builder experts will give you the skills to turn your idea into a world class app. Learn to use the new stacks feature, create adaptable interfaces, employ asset catalogs, and design custom UI to build an outstanding app for Mac, iPhone, iPad and Apple Watch."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/230wt8hs0wt8/230/230_hd_performance_on_ios_and_watchos.mp4?dl=1", "title": "Performance on iOS and watchOS", "summary": "Great performance is a prerequisite for delivering a compelling and immersive app experience that keeps users engaged. Learn best practices and strategies for characterizing and improving the performance of your code for iPhone, iPad, and Apple Watch."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/219u3bqgvsz2g/219/219_hd_mysteries_of_auto_layout_part_2.mp4?dl=1", "title": "Mysteries of Auto Layout, Part 2", "summary": "Continue your pursuit of Auto Layout mastery. Gain high level insight into how Auto Layout works, and strategies for debugging layout issues. Learn how to use new APIs for constraint creation and layout guides to build more complex layouts."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/2187le7kpyhdff/218/218_hd_mysteries_of_auto_layout_part_1.mp4?dl=1", "title": "Mysteries of Auto Layout, Part 1", "summary": "Auto Layout is a powerful constraint-based layout engine that can drive complex and dynamic interfaces on both iOS and OS X.   Learn about the new UIStackView, now your first stop for interfaces built with Auto Layout. See how to build self-sizing views using Auto Layout, and gain critical insights into the inner workings of Auto Layout."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/610kn68riy9ms89m/610/610_hd_metal_performance_optimization_techniques.mp4?dl=1", "title": "Metal Performance Optimization Techniques", "summary": "Learn best practices to maximize the efficiency of your Metal based apps and attain high frame rates. Gain insight into powerful tools for analyzing and optimizing performance for both the CPU and GPU. Discover how to identify bottlenecks, tune performance hot-spots, and overcome any hurdles that could keep your app from reaching its potential."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/708xzs0dtwx/708/708_hd_debugging_energy_issues.mp4?dl=1", "title": "Debugging Energy Issues", "summary": "Learn how to debug energy issues in your app. See the energy debugging tools on iOS and walk through debugging common energy issues in a sample app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/718b7aw9tq/718/718_hd_building_responsive_and_efficient_apps_with_gcd.mp4?dl=1", "title": "Building Responsive and Efficient Apps with GCD", "summary": "watchOS and iOS Multitasking place increased demands on your application's efficiency and responsiveness.  With expert guidance from the GCD team, learn about threads, queues, runloops and best practices for their use in a modern app.  Take a deep dive into QoS, its propagation and advanced techniques for debugging your GCD-enabled app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/41097fby32x3opk/410/410_hd_continuous_integration_and_code_coverage_in_xcode.mp4?dl=1", "title": "Continuous Integration and Code Coverage in Xcode", "summary": "Xcode 7 includes new code coverage features to help you design a powerful test harness for your app. Learn all about coverage along with integration and improvements with Xcode Server."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/404l17yio30l549x/404/404_hd_app_thinning_in_xcode.mp4?dl=1", "title": "App Thinning in Xcode", "summary": "The app distribution pipeline is becoming more powerful and flexible. Learn to create full featured apps that are delivered to users devices with new App Thinning features such as slicing and ODR. See how to integrate these new features into your continuous integration and testing processes, and discover workflows for creating on-demand, tailored content."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/413eflf3lrh1tyo/413/413_hd_advanced_debugging_and_the_address_sanitizer.mp4?dl=1", "title": "Advanced Debugging and the Address Sanitizer", "summary": "Discover UI debugging and how to use advanced breakpoint actions to quickly explore and fix your app. Learn how the new Address Sanitizer feature finds buffer overflows, use-after-free errors, and other memory corruption bugs at run time."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/304ywrr62d/304/304_hd_itunes_connect_development_to_distribution.mp4?dl=1", "title": "iTunes Connect: Development to Distribution", "summary": "Get more acquainted with iTunes Connect, your gateway to the App Store. Dive into unique services like TestFlight for beta testing and Transporter to help automate metadata setup for your apps. Discover the power of adding rich media to your app store page, the benefits of broadening your distribution path globally, and the abundance of help resources."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/414sklk5h2k3ki3/414/414_hd_building_better_apps_with_value_types_in_swift.mp4?dl=1", "title": "Building Better Apps with Value Types in Swift", "summary": "Swift supports rich first-class value types in the form of powerful structs, which provide new ways to architect your apps. Learn about the differences between reference and value types, how value types help you elegantly solve common problems around mutability and thread safety, and discover how Swift's unique capabilities might change the way you think about abstraction."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/707ysegpumy/707/707_hd_achieving_allday_battery_life.mp4?dl=1", "title": "Achieving All-day Battery Life", "summary": "Learn why efficient software is the key to long battery life for both OS X and iOS devices. We'll explore where the energy in our batteries goes, how Apple hardware and software efficiently manage energy, and how you can make your code most efficient to ensure long battery life."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/405t69ymgwkmfzc9/405/405_hd_authoring_rich_playgrounds.mp4?dl=1", "title": "Authoring Rich Playgrounds", "summary": "Learn about the new features in Xcode playgrounds such as inline results, auxiliary sources and resources, multiple pages, and markup for formatted text. Find out how to explore programming problems in a playground, and create engaging experiences for teaching and learning."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/2267p2ni281ba/226/226_hd_advanced_nsoperations.mp4?dl=1", "title": "Advanced NSOperations", "summary": "Operations are a flexible way to model your app's business logic, but they can do so much more. See how NSOperation forms the heart of the WWDC app, and how using features like dependencies, readiness, and composition allow you to quickly and easily build dynamic and complex apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/201pps6n6g0nsnz/201/201_hd_ios_accessibility.mp4?dl=1", "title": "iOS Accessibility", "summary": "iOS has transformed the lives of many users with a range of physical and learning disabilities. Learn how to create apps that leverage the power and simplicity of Apple's assistive technologies to make them accessible to the broadest audience possible. Hear about the latest advancements in iOS accessibility and how you can take advantage of them today."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/214b51jlndqja1bpptt/214/214_hd_extending_your_app_with_safari_app_extensions.mp4?dl=1", "title": "Extending your App with Safari App Extensions", "summary": "Learn how to bring your Content Blocker App Extensions to macOS and how to expose your application's abilities through Safari with Safari App Extensions. Safari App Extensions let you take full advantage of web technologies, Cocoa, and other system frameworks that you already use in your app on macOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/302sxabxp0/302/302_hd_whats_new_in_itunes_connect.mp4?dl=1", "title": "What's New in iTunes Connect", "summary": "iTunes Connect is the gateway to sharing your creativity on the App Store. Learn about new opportunities to get your products out on Apple Watch. See how the latest improvements to TestFlight as well as other new upcoming features on the iTunes Connect, will help you make the most of Apple's digital storefront."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/804eub264zh3x4j9yb/804/804_hd_introducing_the_new_system_fonts.mp4?dl=1", "title": "Introducing the New System Fonts", "summary": "Fonts lay at the intersection of design and engineering. Get introduced to typographic principles and how they apply to the San Francisco fonts. Hear what makes this family of fonts unique and how to effectively take advantage of their advanced features. Learn best practices when designing and implementing interfaces with text."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/303qzm09e7/303/303_hd_getting_the_most_out_of_app_analytics.mp4?dl=1", "title": "Getting the Most out of App Analytics", "summary": "App Analytics is the powerful new tool inside iTunes Connect. Get a walk through of the metrics related to user engagement, marketing campaigns, monetization and more. Gain valuable insights from data that only Apple provides, so you can build better iOS apps and a more informed app business."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/215e597a1en6wrh89hm/215/215_hd_focus_interaction_on_tvos.mp4?dl=1", "title": "Focus Interaction on tvOS", "summary": "The focus interaction model is a critical component of an engaging and intuitive experience on tvOS. Learn more about how it works, some additions and changes to the API, as well as tips and tricks for making your tvOS app even better."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/230b83wfxc7m69dm90q/230/230_hd_enhancing_voip_apps_with_callkit.mp4?dl=1", "title": "Enhancing VoIP Apps with CallKit", "summary": "CallKit is a new framework that lets your VoIP app integrate tightly with the native Phone UI. Learn how you can have your incoming calls displayed fully on the lock screen. Get details on how people can choose to use your app when making calls from the native Phone app's contacts, favorites, and recents. See how adopting CallKit lets your app coexist seamlessly with other active calls, and allow your calls to interact with CarPlay and Bluetooth accessories."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/225e97ww3majsu3bvt8/225/225_hd_extending_your_apps_with_sirikit.mp4?dl=1", "title": "Extending Your Apps with SiriKit", "summary": "Learn by example how to integrate SiriKit into your app. See how easily you can create your first Intents extension to expose your app's core functionality in Siri. Find out how to bring your app's user interface into Siri, creating a unique and recognizable experience for your customers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/301tcfp66f/301/301_hd_whats_new_in_managing_apple_devices.mp4?dl=1", "title": "What's New in Managing Apple Devices", "summary": "Learn about the latest developments in managing Apple devices in large organizations. Learn the latest techniques to wirelessly configure settings, monitor compliance with policies, install apps and bulk configure devices with ease."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/709tvxadw201avg5v7n/709/709_hd_engineering_privacy_for_your_users.mp4?dl=1", "title": "Engineering Privacy for Your Users", "summary": "Learn about new developments in Privacy on iOS, macOS, watchOS, and tvOS that impact you and your apps. Explore techniques to respect your users' privacy while building great features into your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/725xk1hwmcfqkiv0jfh/725/725_hd_deploying_airprint_in_enterprise.mp4?dl=1", "title": "Deploying AirPrint in Enterprise", "summary": "AirPrint works everywhere, including Enterprise environments. Learn how to deploy AirPrint in the Enterprise, how to set up an AirPrint Bluetooth Beacon which is new in iOS 10, and how to make sure your users take full advantage of AirPrint features."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/723x16j75lwkg414uxk/723/723_hd_developing_carplay_systems_part_2.mp4?dl=1", "title": "Developing CarPlay Systems, Part 2", "summary": "Learn how CarPlay integrates with your car's infotainment system. Understand how CarPlay is designed to work with your car's resources including the display, speakers, microphone, user inputs, steering wheel controls, instrument cluster and sensors."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/722x2eefo3u2rp8k8qs/722/722_hd_developing_carplay_systems_part_1.mp4?dl=1", "title": "Developing CarPlay Systems, Part 1", "summary": "CarPlay is a smarter, safer way to use your iPhone in the car. Learn how CarPlay works and how to design your car's infotainment system to work seamlessly with iPhone. Understand best practices for a great user experience that integrates CarPlay with the car's native system."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/802z6j79sd7g5drr7k7/802/802_hd_designing_for_tvos.mp4?dl=1", "title": "Designing for tvOS", "summary": "Change the way the world experiences television through apps that are designed to be immersive, intuitive and easy to use. Learn best practices and techniques to take advantage of the big screen and the Siri Remote."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/804zpr8et6qv87n8j1z/804/804_hd_designing_great_apple_watch_experiences.mp4?dl=1", "title": "Designing Great Apple Watch Experiences", "summary": "watchOS 3 represents a big leap forward for Apple Watch and the apps that run on it. Performance improvements, powerful graphics and animation capabilities, deeper access to device capabilities, and a refined navigation model lay the foundation for designing useful and stunning Apple Watch apps. Learn best practices and techniques for making complications, notifications and apps that are highly actionable, glanceable and responsive."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/239ebj00keggvd2m2fx/239/239_hd_crafting_modern_cocoa_apps.mp4?dl=1", "title": "Crafting Modern Cocoa Apps", "summary": "Examine the technologies that make a modern macOS app. Come learn from the experts how to harness the power of Cocoa to build powerful, immersive apps. Whether you're a seasoned Cocoa developer or new to the platform, this session is for you."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/716vyncka4gcaxxwuvq/716/716_hd_core_location_best_practices.mp4?dl=1", "title": "Core Location Best Practices", "summary": "Discover how to give users a great location-aware experience while conserving power across all Apple platforms. Learn best practices for using Core Location, how an App can use and manage Circular and Beacon Regions, defer or pause location updates, and how to use Visit Monitoring to determine the interesting places the user has been. Get an overview of how a user authorizes an App's use of location services."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/231bhrh1z1fzrejhbz7/231/231_hd_cloudkit_best_practices.mp4?dl=1", "title": "CloudKit Best Practices", "summary": "CloudKit keeps app data updated across iOS, macOS, watchOS, tvOS, and the web so you can focus on building your app. Hear best practices from the CloudKit engineering team about how to take advantage of the APIs and push notifications in order to provide your users with the best experience. Learn about the ways Apple apps use CloudKit and how you can apply the same approaches in your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/235dk9q4a4mflq2dbms/235/235_hd_building_great_workout_apps.mp4?dl=1", "title": "Building Great Workout Apps", "summary": "HealthKit provides robust tools for building great workout apps for Apple Watch. Learn how your workout app can collect data from Watch sensors, run and analyze data in real-time in the background, and contribute to Activity rings. Gain insights into creating a great standalone Watch experience and see how to display your workouts within the Health app and the Activity app on iOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/227a480gfx4hwinv5x9/227/227_hd_architecting_for_performance_on_watchos_3.mp4?dl=1", "title": "Architecting for Performance on watchOS 3", "summary": "A well performing Watch app begins with great app architecture. Join us to discover strategies you can apply to keep your app responsive, lower your app's resume time, and stay memory efficient. Learn how we used these same principles in the Stocks app to enhance the user experience for watchOS 3."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/703rx8zlfedjfom6l93/703/703_hd_apple_pay_on_the_web.mp4?dl=1", "title": "Apple Pay on the Web", "summary": "This year, Apple Pay is coming to the web with Safari on both macOS and iOS. Now you can experience the convenience and security of Apple Pay in your store, in your app, and on your website. Discover how easy it is to set up Apple Pay on the web, and learn how designing for Apple Pay can increase conversions, user engagement, and customer satisfaction."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/216v55u6zpxizxkml6k/216/216_hd_advances_in_uikit_animations_and_transitions.mp4?dl=1", "title": "Advances in UIKit Animations and Transitions", "summary": "Direct onscreen manipulation is the cornerstone of the user experience on iOS. iOS 10 includes new support for making onscreen interactions even more immersive and interactive. Dive straight into the philosophy and techniques of building completely interactive, interruptible animations in your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/708tbh8wnspsg01hxwx/708/708_hd_advanced_notifications.mp4?dl=1", "title": "Advanced Notifications", "summary": "3D Touch on Notifications provides users with access to media attachments and live content. See how your app can take advantage of this new functionality to provide a rich interactive experience within the notification itself."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/228a1kbxogojm4fviqc/228/228_hd_a_peek_at_3d_touch.mp4?dl=1", "title": "A Peek at 3D Touch", "summary": "3D Touch adds a completely new dimension to the iOS user interface and introduces an entirely new way to interact with your iPhone. Explore the existing API and get introduced to additions in iOS 10 that allow you to push the boundaries of 3D Touch. Learn about best practices for incorporating 3D Touch into your apps, how to add support for Quick Actions, Peek, and Pop."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/101g0jrsvv5qcoduisk/101/101_hd_keynote.mp4?dl=1", "title": "Keynote", "summary": "WWDC 2016 Keynote"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/402h429l9d0hy98c9m6/402/402_hd_whats_new_in_swift.mp4?dl=1", "title": "What's New in Swift", "summary": "Hear about the newest features in Swift 3, the third major release of the safe, fast, and expressive language, and the first major release built with the open source community. Gain insight into the latest changes in Xcode including enhanced migration support to help move your code to Swift 3. Learn how you can get involved in the open source community at Swift.org."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/405i2ilotov3bazyei1/405/405_hd_whats_new_in_llvm.mp4?dl=1", "title": "What's New in LLVM", "summary": "The Apple LLVM compiler in Xcode 8 adds new language features, improved diagnostics, and more powerful optimizations. Get an overview of some new Objective-C and C++ features and learn how to use advanced optimizations to speed up your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/207i37356qcyyh2yxos/207/207_hd_whats_new_in_foundation_for_swift.mp4?dl=1", "title": "What's New in Foundation for Swift", "summary": "Underlying nearly every iOS, macOS, watchOS, and tvOS application sits the Foundation framework. See how improvements to the fundamental set of API in Foundation will improve the experience of using Swift for the entire Cocoa and Cocoa Touch SDK. Learn how Foundation framework's new value types, adoption of standard library protocols, additional type safety, better generics, and custom operators will also make your own Swift code safer, faster, and more expressive."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/418kmcxcwg4psxzsjuy/418/418_hd_using_time_profiler_in_instruments.mp4?dl=1", "title": "Using Time Profiler in Instruments", "summary": "Learn how to make your apps faster and more efficient in this introduction to Time Profiler in Instruments. Walk through how to use Time Profiler to measure your app's performance. Learn how Time Profiler works and can be used to identify problems and verify your fixes. Discover how easy it is to improve your app's power usage and performance by using Instruments throughout your development process."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/721wh2etddp4ghxhpcg/721/721_hd_unified_logging_and_activity_tracing.mp4?dl=1", "title": "Unified Logging and Activity Tracing", "summary": "The new Unified Logging and Tracing System for iOS and macOS uses Activity Tracing for performance, consolidates kernel and user-space logging, and has many other improvements. Learn how Logging and Tracing can help you debug and troubleshoot issues with your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/236dnxhy85jkit108dh/236/236_hd_whats_new_in_auto_layout.mp4?dl=1", "title": "What's New in Auto Layout", "summary": "Get details about new features of Auto Layout in Xcode, Cocoa and Cocoa Touch. Explore the new NSGridView, allowing your Cocoa app to easily build grid interfaces. Dive deeper into new tools that enable you to quickly diagnose layout issues in your interface. Learn about the new features in Xcode to quickly build adaptive interfaces."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/410jaf5ko3ob8asajlf/410/410_hd_visual_debugging_with_xcode.mp4?dl=1", "title": "Visual Debugging with Xcode", "summary": "Discover Xcode's enhancements for debugging autolayout issues at runtime. Learn how issues inside complex GKStateMachine objects can be easily debugged at runtime. Gain insight into finding performance bottlenecks inside SpriteKit and SceneKit apps more easily with the enhanced FPS gauge. Understand how to fix leaked and abandoned memory in your app by inspecting the heap from within your typical Xcode debugging workflow."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/414k6h6qdzyihpowpaa/414/414_hd_using_and_extending_the_xcode_source_editor.mp4?dl=1", "title": "Using and Extending the Xcode Source Editor", "summary": "Learn about all of the new, and a few existing, features of Xcode source editor. See how you can make the most of new code completion features, Swift image and color literals, and snippets. We'll also show how to add commands to the source editor with new Xcode Extensions that you can distribute on the Mac App Store."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2017/305k3ed4sd37at/305/305_hd_advanced_storekit.mp4?dl=1", "title": "Advanced StoreKit", "summary": "Gain an understanding of the pros and cons of server- versus app-based receipt validation, and how to implement this critical functionality for your In-App Purchases.  Get the latest news, and valuable tips for keeping subscribers and managing subscriptions. Learn about a major improvement to In-App Purchases: Server-to-Server Notifications. And finally, get detailed instructions for testing with the In-App Purchase sandbox."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2015/2048w4vdjhe1i1m/204/204_hd_apple_watch_accessibility.mp4?dl=1", "title": "Apple Watch Accessibility", "summary": "Building on the strong accessibility support in iOS, Apple Watch offers assistive features like VoiceOver and Zoom.  Gain insights into how these accessibility features work on Apple Watch, and how to make sure your app can be accessible to all users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/416k7f0xkmz28rvlvwb/416/416_hd_understanding_swift_performance.mp4?dl=1", "title": "Understanding Swift Performance", "summary": "In this advanced session, find out how structs, classes, protocols, and generics are implemented in Swift. Learn about their relative costs in different dimensions of performance. See how to apply this information to speed up your code."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/412jzguxz4h8hykgjlm/412/412_hd_thread_sanitizer_and_static_analysis.mp4?dl=1", "title": "Thread Sanitizer and Static Analysis", "summary": "Xcode 8 makes it easier to find several new categories of bugs with improvements in Runtime Sanitization and the Clang Static Analyzer. The Thread Sanitizer will help you find data races and other concurrency bugs. The static analyzer has been extended to search for localizability issues, check nullability, and find memory leaks in MRR code."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/411jge60tmuuh7dolja/411/411_hd_system_trace_in_depth.mp4?dl=1", "title": "System Trace in Depth", "summary": "Join engineers from the Instruments team for another focused look at the System Trace Instruments profiling template and how to get the most out of it. Discover how threads, virtual memory, and locking interact to affect performance. Dive deep for a practical look at how you can improve your app's responsiveness and keep your users engaged."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/403hb0ie2m86hvs7yyn/403/403_hd_swift_api_design_guidelines.mp4?dl=1", "title": "Swift API Design Guidelines", "summary": "Swift 3 introduces new API Design Guidelines specifically crafted to the unique character of Swift for clear, concise code. This talk will explore the philosophy behind the Swift API Design Guidelines and their application throughout the Swift Standard Library and the Cocoa and Cocoa Touch APIs. See how this API transformation will affect your Swift code and learn how to ensure a smooth transition to Swift 3. Learn how Swift 3 imports Objective-C APIs and how to expose rich Swift interfaces for existing Objective-C libraries."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/419lgbsyhjrmqtmq0qh/419/419_hd_protocol_and_value_oriented_programming_in_uikit_apps.mp4?dl=1", "title": "Protocol and Value Oriented Programming in UIKit Apps", "summary": "Building on last year's Protocol-Oriented Programming and Building Better Apps with Value Types sessions, this year's session will highlight tips and tricks for building better Swift apps. See how you can incorporate these design approaches into a real MVC-based Cocoa Touch app, especially in the view and controller layers, where you might not have thought of using these techniques before."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/719wve0t1j24kny0f9r/719/719_hd_optimizing_io_for_performance_and_battery_life.mp4?dl=1", "title": "Optimizing I/O for Performance and Battery Life", "summary": "Gain specific insights into tuning your application for better I/O performance. Learn best practices to reduce local storage operations and trim your memory usage. Get details on how to update your app to increase responsiveness and extend battery life."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/406i3zbazbegkeh0udt/406/406_hd_optimizing_app_startup_time.mp4?dl=1", "title": "Optimizing App Startup Time", "summary": "Launching an App is a complicated and subtle process and the ramifications on launch times of different App design patterns are often non-obvious. Come learn what happens in the time between when an App begins launching and when the main() function gets control and how that time relates to the code and structure of your App. Learn about the inner details of the dynamic loader, dyld, and best practices for structuring your code to perform at its best from the very start."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/222l873ttj77llkzbzs/222/222_hd_making_apps_adaptive_part_1.mp4?dl=1", "title": "Making Apps Adaptive, Part 1", "summary": "In this first part of a two part series, explore the motivation and concepts necessary to take advantage of trait collections. Walk through building an interface in Xcode and learn from the experts how to take advantage of new features to more easily create your app for different device sizes and configurations."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/413jz6eb2wkfuzwx1me/413/413_hd_introduction_to_xcode.mp4?dl=1", "title": "Introduction to Xcode", "summary": "Xcode enables you to create great apps for Apple platforms. This session will introduce you to the basics of creating a project with Xcode, and more. You'll learn how to comfortably navigate your project and gain insights into working with workspaces, targets, and schemes. We'll introduce you to version control workflows, and walk through using Xcode's source editors and design tools. Join us if you're new to Apple platforms or want to learn more about using Xcode."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/408j7syjtdlxnl2rq4j/408/408_hd_introducing_swift_playgrounds.mp4?dl=1", "title": "Introducing Swift Playgrounds", "summary": "Learn more about Swift Playgrounds, the new iPad app that teaches coding using the powerful Swift programming language. Explore the featured content, complete with puzzles that help you master each coding concept. Learn more about the coding features of Swift Playgrounds and see how the editing experience was re-imagined for touch. Learn to use the included templates to build playgrounds and look at the available features in the new playground book format."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/213r47rtymgcyythv7w/213/213_hd_improving_existing_apps_with_modern_best_practices.mp4?dl=1", "title": "Improving Existing Apps with Modern Best Practices", "summary": "The best way to avoid technical debt is to incrementally build-up technical credit. This session builds on last year's Modernizing Existing Apps with Swift presentation to show you how you can continue modernizing your codebase while adopting best practices and adding new feature work."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/415kvwo632dbu5csn3g/415/415_hd_going_serverside_with_swift_open_source.mp4?dl=1", "title": "Going Server-side with Swift Open Source", "summary": "While the Swift language makes it easy to write software that is incredibly fast and safe by design, Swift being open source means you can use it on an even broader range of platforms, from mobile devices to the desktop and in the cloud. Come for an overview of available projects at Swift.org and examples of the community in action."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/404hskg1ijeev16mdej/404/404_hd_getting_started_with_swift.mp4?dl=1", "title": "Getting Started with Swift", "summary": "Updated to include the latest features, syntax and best practices for Swift 3, this session introduces the basics of the Swift programming language. Learn the recommended manner in which to declare variables, define functions, work with fundamental value types, protocols, generics, and more. Explore some of the great features that make Swift a safe, fast, and expressive language."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/417kbvnnlivhyfnn98p/417/417_hd_debugging_tips_and_tricks.mp4?dl=1", "title": "Debugging Tips and Tricks", "summary": "Spend an hour with the team responsible for the technology behind Xcode's debugger: LLDB. Find out what's new, what's been there all along that you didn't know about, and how best to take advantage of it all. This session will cover a range of topics with tips for both newcomers and experienced developers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/720w6g8t9zhd23va0ai/720/720_hd_concurrent_programming_with_gcd_in_swift_3.mp4?dl=1", "title": "Concurrent Programming With GCD in Swift 3", "summary": "Swift 3 provides new interfaces that make it easier than ever to write applications with Grand Central Dispatch. Learn the basics of GCD and best practices on how to use it to architect your Swift application. You'll also hear about new APIs and other GCD improvements."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/409jh83sf1h8dqrt00q/409/409_hd_advanced_testing_and_continuous_integration.mp4?dl=1", "title": "Advanced Testing and Continuous Integration", "summary": "Take an advanced class in Testing and Xcode Server. You'll gain an in-depth knowledge on the lifecycle of a test, how they're are hosted, and how using modern observation can help you make bulletproof tests for your app. Then, learn about changes in Xcode Server that make continuous integration easier than ever, including configuring your own user for testing, enhancements to issue tracking, email notifications and support for crash logs."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/105o1y9n857rpjpmu27/105/105_hd_tapping_into_innovative_solutions_to_save_the_worlds_wildlife.mp4?dl=1", "title": "Tapping into Innovative Solutions to Save the World's Wildlife", "summary": "Wildlife populations across the globe face innumerable threats that have resulted in dwindling numbers of many species. Ginette Hemley, SVP of Wildlife Conservation at World Wildlife Fund, will take us through many of the bold new approaches to conservation that organizations like WWF are taking to tackle these challenges. One of the most promising and potentially game-changing ideas for solving conservation problems around the world is by applying technology in creative new ways. From examining polar bear DNA to utilizing devices such as thermal imaging cameras and gunshot detectors to drawing upon the power of social networks and apps, learn about the surprising ways that WWF and its partners are harnessing the power of technology to keep up with the planet's most urgent wildlife conservation challenges."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/108h16qehvq9hdjuf96/108/108_hd_marvel_making_a_difference_in_the_real_world.mp4?dl=1", "title": "Marvel: Making a Difference in the Real World", "summary": "The heroes and villains of Marvel have captivated a worldwide audience for over 75 years. Marvel Games Creative Director Bill Rosemann lifts up the masks of Spider-Man, Black Panther, the Guardians of the Galaxy and more to reveal the true power behind the world's most heroic brand."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/305h9fsce1kcqkvmtvk/305/305_hd_whats_new_in_itunes_connect.mp4?dl=1", "title": "What's New in iTunes Connect", "summary": "iTunes Connect has been updated to make your experience with delivering apps to the App Store even better. Learn about time-saving improvements to managing screenshots, new ways to stay up to date with the iTunes Connect for iOS app, and upcoming features to help you gain insights into your data in App Analytics."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/606oluchfgwakjbymy8/606/606_hd_advanced_metal_shader_optimization.mp4?dl=1", "title": "Advanced Metal Shader Optimization", "summary": "The Metal shading language is an easy-to-use programming language for writing graphics and compute functions which execute on the GPU. Dive deeper into understanding the design patterns, memory access models, and detailed shader coding best practices which reduce bottlenecks and hide latency. Intended for experienced shader authors with a solid understanding of GPU architecture and hoping to extract every possible cycle."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/106r1nsdtsnrih7t6id/106/106_hd_talking_in_pictures_reconstructing_the_building_blocks_of_language.mp4?dl=1", "title": "Talking In Pictures: Reconstructing the Building Blocks of Language", "summary": "When Ajit Narayanan began working on technologies for children with disabilities in India in 2008, it was the beginning of an incredible journey down a rabbit hole — one that took him and his team on a wild ride across the worlds of electrical engineering, autism, cross-cultural communication and the mathematics of language. His journey led him to build Avaz, a wheelchair-mounted tablet to help people with disabilities communicate, then even more ambitiously, to invent FreeSpeech, an entirely new visual language that could break down language barriers altogether. Ajit will talk about the series of events that led to the creation of the Avaz and FreeSpeech apps, their impact in India and around the world (earning him the National Award for Empowerment of People with Disabilities from the President of India) and his ideas on the transformative role that apps can play in education."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/401hmew12wifry4svvi/401/401_hd_whats_new_in_xcode_app_signing.mp4?dl=1", "title": "What's New in Xcode App Signing", "summary": "Xcode provides powerful options for managing projects for small and large development teams. Learn how new features in Xcode simplify the process of certificate management, app signing and configuration of your project's build settings."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/303g7ecrjttz4lpqd7y/303/303_hd_whats_new_in_apple_device_management.mp4?dl=1", "title": "What's New in Apple Device Management", "summary": "Learn about the latest developments in managing Apple devices in large organizations including Classroom and Shared iPad for Education. Learn the latest techniques to wirelessly configure settings, monitor compliance with policies, install apps and bulk configure devices with ease."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/202w2zhc4l8yomptqnt/202/202_hd_whats_new_in_accessibility.mp4?dl=1", "title": "What's New in Accessibility", "summary": "Explore the new accessibility features for iOS, tvOS, and macOS. Gain specific knowledge of how best to adapt your app to make it accessible to everyone, regardless of their physical or learning abilities. Learn from the experts about advanced accessibility topics and how best to structure your app interface for accessibility."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/702rhpkb0ux7uuzixps/702/702_hd_using_store_kit_for_inapp_purchases_with_swift_3.mp4?dl=1", "title": "Using Store Kit for In-App Purchases with Swift 3", "summary": "The StoreKit API allows apps to request payment for additional functionality or content. Hear about the latest changes to StoreKit including Swift 3.0 APIs, updates to Subscriptions and using StoreKit with iMessage apps. Learn best practices for receipt management and Sandbox testing."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/803z7m1ln9vmbpg35x9/803/803_hd_typography_and_fonts.mp4?dl=1", "title": "Typography and Fonts", "summary": "Typography is essential to an app's form and function. Learn principles of good typography and techniques to apply them to your work. Make the most of the advanced features in our system fonts, and learn best practices for using custom fonts."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/302f5hkfjyg13j84oda/302/302_hd_introducing_search_ads.mp4?dl=1", "title": "Introducing Search Ads", "summary": "Search Ads provides a new way to increase awareness of your apps in App Store search results. Learn how sponsored ads in App Store search work, see a preview of the powerful targeting options, reporting and attribution features and how quick and easy it is to get started."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/407itxn2ujs52fwcgw5/407/407_hd_auditing_your_apps_for_accessibility.mp4?dl=1", "title": "Auditing Your Apps for Accessibility", "summary": "Making your app accessible helps you reach all of your potential users. Get introduced to the new Accessibility Inspector and learn how it streamlines finding and fixing accessibility issues across all Apple platforms. Go beyond the basics with our experts as they guide you through the process of optimizing accessibility for your app"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/206jn5qnngdzy9/206/206_hd_whats_new_in_watchos.mp4?dl=1", "title": "What's New in watchOS", "summary": "watchOS 5 makes creating great experiences on Apple Watch easier than ever before. Learn about robust capabilities to create rich and interactive notifications, a new background mode and controls for audio playback, shortcuts that bring your apps to the Siri watch face, and more. See what's new in watchOS and discover how to expand your app's presence on the wrist."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/301fbtjd9exjetky78s/301/301_hd_introducing_expanded_subscriptions_in_itunes_connect.mp4?dl=1", "title": "Introducing Expanded Subscriptions in iTunes Connect", "summary": "See what's new in subscriptions. Learn how our improvements give you more flexibility and control over pricing, and provide powerful incentives to engage and retain your customers."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/717nagdm5s7ynqf/717/717_hd_vision_with_core_ml.mp4?dl=1", "title": "Vision with Core ML", "summary": "Using Core ML models in Vision makes the creation of powerful Computer Vision applications easy. Learn how easy it is to use custom trained classifiers and object recognition models in a live camera capture. In addition, you'll learn about the latest additions to the Vision Framework along with a deeper dive into some its fundamentals."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/104b1061nbty638w2cd/104/104_hd_disability_and_innovation_the_universal_benefits_of_accessible_design.mp4?dl=1", "title": "Disability and Innovation: The Universal Benefits of Accessible Design", "summary": "White House Champion of Change, Forbes 30 under 30 leader, and BBC Women of Africa Hero, Haben Girma is an acclaimed accessibility and inclusion advocate. The first deaf blind person to graduate from Harvard Law School, Haben champions equal access to information for people with disabilities, earning her recognition from both President Obama and President Clinton. Through this presentation, Haben will share how designing with accessibility in mind benefits not just users with disabilities, but developers, too. Throughout history, disability has sparked innovation, leading to breakthroughs in wide-ranging inventions from keyboards to telephones. Hear Haben's remarkable story and learn how incorporating universal access principles into product development can increase access for people with disabilities while simultaneously improving the overall usability of your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/716xqb0exkswff/716/716_hd_object_tracking_in_vision.mp4?dl=1", "title": "Object Tracking in Vision", "summary": "Vision is a high-level framework that provides an easy to use API for handling many computer vision tasks. We'll dive deep into a particularly powerful feature of Vision—tracking objects in video streams. Learn best practices for using Vision in your app. Gain a greater understanding of how request handlers function in terms of lifecycle, performance, and memory utilization."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/506dgb08enfpgn2c58s/506/506_hd_musickit_on_the_web.mp4?dl=1", "title": "MusicKit on the Web", "summary": "MusicKit has enabled the creation of new, compelling, and engaging Apple Music powered app experiences. With the introduction of MusicKit on the web, as a developer, you can now bring Apple Music powered experiences to the web. Learn how to use declarative markup or javascript to enable Apple Music on your website."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2016/304heg1mrvxxz5lhd4h/304/304_hd_best_practices_for_building_apps_used_in_business_and_education.mp4?dl=1", "title": "Best Practices for Building Apps Used in Business and Education", "summary": "Even consumer-focused apps are used by people in business and education. See how minor changes can fine tune your app to meet the needs of these large organizations. Learn best practices for synching user-specific content on Shared iPad and how to add deep-link support for Classroom app, authentication integration via Touch ID, AppConfig driven customization, and much more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/502plwzfxg5p7w4na/502/502_hd_measuring_and_optimizing_hls_performance.mp4?dl=1", "title": "Measuring and Optimizing HLS Performance", "summary": "HTTP Live Streaming (HLS) is used to stream live and on-demand content to global audiences. Discover how to adjust and tune stream authoring and delivery elements to improve the viewing experience. Learn how to accurately measure your streaming performance, identify optimization opportunities, and implement changes to your HLS streams that can significantly improve the user experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/601nz4m863hyf0/601/601_hd_live_screen_broadcast_with_replaykit.mp4?dl=1", "title": "Live Screen Broadcast with ReplayKit", "summary": "ReplayKit 2 provides built-in services for broadcasting your screen from iOS and tvOS to viewers online. See how broadcasts can be started right within Control Center or from standard UI included in your own apps and games. Hear about developing broadcast extensions for ReplayKit 2 and get best practices for handling account sign-in."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/501rzej45eysiycpu/501/501_hd_introducing_podcast_analytics.mp4?dl=1", "title": "Introducing Podcast Analytics", "summary": "Podcasts are created and enjoyed by millions of people around the world. With the addition of Podcast Analytics, podcasters can gather actionable and insightful intelligence into how their show is consumed, while respecting the privacy of their listeners. Learn how to interpret and use these new analytics to improve your show."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/505em1a6u6lq35/505/505_hd_integrating_with_photos_on_macos.mp4?dl=1", "title": "Integrating with Photos on macOS", "summary": "Make your apps even better through improved integration with Photos on macOS. We'll dive deep into the Photos Project Extension API that was introduced in macOS High Sierra and update you on what's new. You'll also learn best practices for handling file promises and image URLs to better handle drag & drop from Photos to your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/219mybpx95zm9x/219/219_hd_image_and_graphics_best_practices.mp4?dl=1", "title": "Image and Graphics Best Practices", "summary": "Whether it's for UI elements or a fundamental part of your application, at some point, you have to handle images. This session is packed with engaging insight into how images are handled in iOS including discussion of UIImage, UIImageView, custom drawing in UIKit, plus advanced CPU and GPU techniques that can help you maximize performance and minimize memory footprint."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/503rfgg72ckqxj2fi/503/503_hd_creating_photo_and_video_effects_using_depth.mp4?dl=1", "title": "Creating Photo and Video Effects Using Depth", "summary": "The TrueDepth camera in the iPhone X streams high-quality depth data in real time allowing you to enhance your photo and video apps in fun and creative ways. Dive deep into the principles and best practices for working with depth data, learn how to use the new Portrait Segmentation API for still images, and see how these techniques can create special effects like background replacement and perspective changes."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/504uv2gj8r9250n/504/504_hd_creating_audio_apps_for_watchos.mp4?dl=1", "title": "Creating Audio Apps for watchOS", "summary": "Apps in watchOS 5 have control over audio playback like never before.  With a full-fledged background mode for local audio playback using AVFoundation, people can listen to content on the go right from Apple Watch. Learn how to use the new volume control and how to respond to MediaRemote commands. Dive into best practices for getting audio onto Apple Watch with URLSession and update progress when using WatchConnectivity to transfer files from iPhone. Explore how to control playback on iPhone from your app with the new Now Playing view."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/507axjplrd0yjzixfz/507/507_hd_avcontentkeysession_best_practices.mp4?dl=1", "title": "AVContentKeySession Best Practices", "summary": "AVContentKeySession allows for the management of FairPlay content decryption keys for HTTP Live Streaming. It offers a simplified key loading process that provides applications with control over the lifecycle of content keys, and features such as dual-expiry keys for offline movie rentals. Learn about best practices and recommended patterns for adopting this API."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/602r0zx2q17fqbk/602/602_hd_whats_new_in_arkit_2.mp4?dl=1", "title": "What’s New in ARKit 2", "summary": "ARKit 2 makes it easy to develop vivid augmented reality experiences and enable apps to interact with the real world in entirely new ways. Discover how multiple iOS devices can simultaneously view an AR scene or play multiplayer AR games. Learn about new capabilities for tracking 2D images, and see how to detect known 3D objects like sculptures, toys, and furniture."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/610qbth3em1ngixst/610/610_hd_understanding_arkit_tracking_and_detection.mp4?dl=1", "title": "Understanding ARKit Tracking and Detection", "summary": "With ARKit your app can see the world and place virtual objects on horizontal and vertical surfaces and recognize images and objects. Go beyond the API to gain insights into the innovative methods and techniques underlying these capabilities. See how ARKit combines device motion with the camera to provide accurate tracking and plane detection. Get a deeper understanding of persistence and multi-device AR and learn the recommended approach for image tracking and object detection."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/808j4pqwu6uymymjq/808/808_hd_prototyping_for_ar.mp4?dl=1", "title": "Prototyping for AR", "summary": "Designing for AR can be intimidating and discovering design flaws late in the process can be costly. See how low-tech traditional prototyping techniques can help you validate and refine your AR app and game design ideas."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/611q31k82j69jxqw/611/611_hd_metal_for_vr.mp4?dl=1", "title": "Metal for VR", "summary": "On macOS, Metal 2 adds specialized support for virtual reality (VR) rendering and external GPUs. Learn about new features and optimizations to take advantage of these technologies within your Metal 2-based apps and games. Understand best practices for scheduling workloads across multiple GPUs and techniques for frame pacing while multi-threading."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/606id8hzoex3kf/606/606_hd_metal_for_ray_tracing_acceleration.mp4?dl=1", "title": "Metal for Ray Tracing Acceleration", "summary": "Metal Performance Shaders (MPS) harnesses the massive parallelism of the GPU to dramatically accelerate calculations at the heart of modern ray tracing and ray casting techniques. See how ray tracing can provide greater realism in 3D scenes through improved shading, soft shadows, and global illumination. Understand how MPS accelerates ray-triangle intersections while enabling dynamic scene updates, and learn how to extend your app across multiple GPUs for even greater performance."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/604lh97z18yv96g6nhf/604/604_hd_metal_for_opengl_developers.mp4?dl=1", "title": "Metal for OpenGL Developers", "summary": "Metal is the foundation for accelerated graphics and compute on Apple platforms, enabling your apps and games to tap into the incredible power of the GPU. Get introduced to essential Metal capabilities and understand the recommended approach for transitioning OpenGL-based apps onto the Metal API."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/607buro3d9jn66/607/607_hd_metal_for_game_developers.mp4?dl=1", "title": "Metal for Game Developers", "summary": "Metal 2 is Apple-designed graphics software that lets developers build console‑style games. Learn key aspects of the Metal architecture that support the techniques for modern high-performance game rendering. See how Metal now enables the GPU to schedule work for itself, allowing complete scenes and compute workloads to be built and executed with little to no CPU interaction. Understand how the seamless integration of Metal 2 with the A11 Bionic chip lets your apps and games realize entirely new levels of performance and capability."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/608u6qpg6mh0uq/608/608_hd_metal_shader_debugging_and_profiling.mp4?dl=1", "title": "Metal Shader Debugging and Profiling", "summary": "Metal provides powerful tools for analyzing shader behavior and optimizing performance. Dive into troubleshooting vertex-stage problems with new geometry viewing capabilities in Xcode. Use the shader debugger to step through vertex, fragment, and compute shader execution line-by-line. Get details about analyzing GPU workload, and check out shader profiler enhancements for A11 Bionic."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/612wlpc4tnd47e9245/612/612_hd_metal_game_performance_optimization.mp4?dl=1", "title": "Metal Game Performance Optimization", "summary": "Realize the full potential of your Metal-based games by tackling common issues that cause frame rate slowdowns, stutters, and stalls. Discover how to clear up jitter and maintain a silky-smooth frame rate with simple changes in frame pacing. Get introduced to new tools for analyzing rendering passes and pinpoint expensive or unexpected work. Learn how to avoid thread stalls and get specific advice about handling thermal notifications."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/603augiuv41xoowslk8/603/603_hd_integrating_apps_and_content_with_ar_quick_look.mp4?dl=1", "title": "Integrating Apps and Content with AR Quick Look", "summary": "With iOS 12, ARKit includes a built-in viewer for displaying and sharing high-quality 3D content using Pixar's usdz file format. Get introduced to the capabilities of AR Quick Look and see how to easily integrate AR into your app. Learn best practices for preparing 3D models for AR, and see how to deliver usdz content for viewing across Safari, Mail, Messages, and other built-in apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/605sgm2hb3oxmy/605/605_hd_inside_swiftshot_creating_an_ar_game.mp4?dl=1", "title": "Inside SwiftShot: Creating an AR Game", "summary": "Developed by Apple, SwiftShot is an energetic and immersive multiplayer AR game built with key iOS technologies. Glimpse behind the curtain and see how SwiftShot was designed and developed using ARKit, SceneKit, and Swift. Understand the intricacies of designing great gameplay for AR, and learn practical techniques for multiplayer synchronization and physics simulation."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/805llmiw0zwkox4zhuc/805/805_hd_creating_great_ar_experiences.mp4?dl=1", "title": "Creating Great AR Experiences", "summary": "Engaging AR experiences are easy to start and navigate, persuasively realistic, and highly immersive. Learn best practices for successfully bringing people into an AR experience, teaching them about how to interact and engage with virtual content, and making your AR content look beautiful and grounded in the real world."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/719mml6x0gqj3b7udf/719/719_hd_core_image_performance_prototyping_and_python.mp4?dl=1", "title": "Core Image: Performance, Prototyping, and Python", "summary": "Core Image is the essential framework for handling image processing tasks in your photo and video apps. In this session, we'll explore new additions to the framework that allow you to achieve great performance in your filter chains and custom CIKernels. We'll also demo a new approach to prototyping in Core Image through the use of an interactive Python environment. Through these techniques you'll discover new ideas for building new creative effects as well as practical approaches to batch processing images for tasks such as image compositing and data boosting for machine learning."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/702zi9t7twhu9310kz5/702/702_hd_your_apps_and_the_future_of_macos_security.mp4?dl=1", "title": "Your Apps and the Future of macOS Security", "summary": "Apple is on a mission to advance the state of Mac security, and we want your apps to be there with us. Learn about new protections for user data, new capabilities with Developer ID, and how you can best secure your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/710kz0ncc1u8bfxn6/710/710_hd_whats_new_in_user_notifications.mp4?dl=1", "title": "What’s New in User Notifications", "summary": "Local and push notifications enable your app to keep users informed with timely and relevant content, by displaying messages and accepting users' actions, or playing distinctive sounds, or updating the badge on your app icon. Improvements to rich notifications help you create more engaging content and better manage notifications. Find out what's new and get expert advice on implementing user notifications in your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/234iphi7iwpe8ew16w/234/234_hd_whats_new_in_safari_and_webkit.mp4?dl=1", "title": "What’s New in Safari and WebKit", "summary": "Safari and WebKit are continually evolving with new features, APIs, and cutting edge web standards. Learn about this year's biggest feature highlights, designed to help you create richer experiences with better performance and security — whether you are developing content for a browser or developing an app with embedded web content."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/709ofa44hqrgje7a4c/709/709_hd_whats_new_in_core_ml_part_2.mp4?dl=1", "title": "What’s New in Core ML, Part 2", "summary": "The Core ML tools ecosystem gives you many options for building and optimizing models to meet your app requirements. Learn how to add flexibility to existing models, quantize them, and take advantage of Core ML's support for customization."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/708ax570wjtpxze/708/708_hd_whats_new_in_core_ml_part_1.mp4?dl=1", "title": "What’s New in Core ML, Part 1", "summary": "Introduced just one year ago, Core ML has already revolutionized the way apps can benefit from machine learning, by enabling fast and private on device machine learning features for your app. Find out how new Core ML features let you reduce the size of models, make them more flexible, and dramatically improve performance."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/208piymryv9im6/208/208_hd_whats_new_in_tvos_12.mp4?dl=1", "title": "What's New in tvOS 12", "summary": "Apps on tvOS entertain, inform, and inspire with their content and interactive experiences. tvOS 12 brings new technologies that help make these experiences even more enjoyable and engaging. Get an introduction to focus engine support for non-UIKit apps, new UI elements, and Password AutoFill. Learn how to bring it all together to create incredible tvOS apps and experiences."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/238l85zhwz7192hqb/238/238_hd_whats_new_in_tvmlkit.mp4?dl=1", "title": "What's New in TVMLKit", "summary": "With TVMLKit you can quickly and easily develop tvOS apps that deliver intuitive and engaging media experiences. Learn about enhancements to data binding that allow you to separate your application logic and user interface, and new features and functions to customize the media playback experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/202gr4vfnb8iayqu/202/202_hd_whats_new_in_cocoa_touch.mp4?dl=1", "title": "What's New in Cocoa Touch", "summary": "iOS 12 enhances the Cocoa Touch frameworks to improve app performance and deliver exciting new features. Learn about performance best practices, security improvements, tools for supporting multiple screen sizes and shapes, new APIs for iMessage apps, Siri Shortcuts, and Swift refinements. Find out which sessions you won't want to miss throughout the week."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/720gofzcqcp431kcasf/720/720_hd_wallet_and_apple_pay_creating_great_customer_experiences.mp4?dl=1", "title": "Wallet and Apple Pay: Creating Great Customer Experiences", "summary": "Get the latest news and updates from the Wallet and Apple Pay team. Learn how iPhone and Apple Watch can power innovative commerce experiences. Hear about the latest design best practices for Apple Pay. And discover how to create your own contactless passes for rewards cards, gift cards, tickets and more."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/711c5be5c6ma8yy/711/711_hd_using_grouped_notifications.mp4?dl=1", "title": "Using Grouped Notifications", "summary": "Grouping the notifications your app sends helps people get more information at a glance and manage multiple notifications at once. Learn how to implement Grouped Notifications in your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/701bd0jri1hppm1q4/701/701_hd_using_accelerate_and_simd.mp4?dl=1", "title": "Using Accelerate and simd", "summary": "Learn how to use sophisticated Signal and Image Processing techniques to bring higher performance to your apps while lowering battery consumption.  See compelling use cases for the Accelerate framework with interactive demos. Explore using simd—a valuable addition that effortlessly brings vector programming to your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/235gkyrtsva0gy/235/235_hd_uikit_apps_for_every_size_and_shape.mp4?dl=1", "title": "UIKit: Apps for Every Size and Shape", "summary": "Ground-up coverage of how to make an app that can fit on devices of every size and shape. Make your app fit beautifully on Apple's full range of devices with the minimum amount of effort, future-proofing your user experience along the way."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/810yhhz7j3k7d7y/810/810_hd_tips_for_great_maps.mp4?dl=1", "title": "Tips for Great Maps", "summary": "Maps are powerful tools for conveying information. Learn key cartographic principles that will help you create beautiful, useful maps so that your users can get the most out of your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/801srpnrtij2lqi6/801/801_hd_the_qualities_of_great_design.mp4?dl=1", "title": "The Qualities of Great Design", "summary": "Great Design isn't magic, it is crafted with care by real people. Explore the characteristics of great design through the voices of designers from Apple and our developer community. Learn how they take inspiration from everyday life, conceive and refine ideas, and push themselves to design apps and games that can stand the test of time."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/804hwsr1us28uuau99o/804/804_hd_the_life_of_a_button.mp4?dl=1", "title": "The Life of a Button", "summary": "An in-depth exploration of essential interaction, visual and sound design principles and techniques through the design of a simple button."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/221dm4k4kaqjqapkxt/221/221_hd_textkit_best_practices.mp4?dl=1", "title": "TextKit Best Practices", "summary": "Leverage the abilities of TextKit to provide the best experience possible displaying and editing text. Get the best performance out of your app by using TextKit effectively. Learn the concepts to do more complex handling, layout and presentation."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/207m5757sq9wfhvby/207/207_hd_strategies_for_securing_web_content.mp4?dl=1", "title": "Strategies for Securing Web Content", "summary": "Whether you use web content in your app via an embedded WebKit view, deliver pure web apps, or create web content to be embedded by others, it's important to ensure that you are using the most current web security standards. Learn techniques like such as special cookie attributes and HTTP response headers designed to secure your web content against the latest threats that include cross-site scripting, cross-site request forgeries, and speculative execution attacks, commonly known as Spectre."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/217qlkasup9hplnx0r3/217/217_hd_siri_shortcuts_on_the_siri_watch_face.mp4?dl=1", "title": "Siri Shortcuts on the Siri Watch Face", "summary": "Learn how to use Siri Shortcuts to bring glanceable information and custom interactions to the Siri watch face. Walk through how to create a compelling user experience by providing relevant shortcuts and by donating interactions from your app. See how these experiences can be created from both watchOS and iOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/237fjfpla4kbr1m/237/237_hd_quick_look_previews_from_the_ground_up.mp4?dl=1", "title": "Quick Look Previews from the Ground Up", "summary": "Quicklook Previews are an easy way preview documents in your app. Hear about the basics as well as some advanced implementations. Learn to present a variety of types of documents from within your app without reinventing the wheel, and make sure your custom file format works great with the built-in support offered by iOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/714px070n75l8ri/714/714_hd_optimizing_your_app_for_todays_internet.mp4?dl=1", "title": "Optimizing Your App for Today’s Internet", "summary": "Learn what Apple has been doing to help your app get the most out of the network with the least effort. Let Apple's networking APIs do the heavy lifting for you. Learn best practices for getting top networking performance from your app using the URLSession APIs."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/707liyrusj4qu2rj1z/707/707_hd_new_ways_to_work_with_workouts.mp4?dl=1", "title": "New Ways to Work with Workouts", "summary": "Tracking workouts with Apple Watch is popular with fitness professionals and novices alike.  See how the new workout API streamlines the entire lifecycle of a workout, complete with ability to restart a session after a crash to prevent you from losing data. Learn how the new workout classes, types, and queries provide quick access to baseline sample data you would typical calculate without limiting access to the fine grained samples you may occasionally require."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/216dvfcqmzmak5qs/216/216_hd_managing_documents_in_your_ios_apps.mp4?dl=1", "title": "Managing Documents In Your iOS Apps", "summary": "Last year we introduced the Files App and an easy way to view, edit, and share documents within your application. Learn best practices for implementing this technology, how to effectively manage documents in your app, and how to avoid common document manager pitfalls. Hear about the difference between a Document Browser and a Document Picker and when to use them. Gain a better understanding into how this technology works in a sandbox. Learn how to give your customers a great experience, beginning at sign-in and continuing throughout your app!"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/211fjjqs9t1cbwzwgf0/211/211_hd_introduction_to_siri_shortcuts.mp4?dl=1", "title": "Introduction to Siri Shortcuts", "summary": "Siri Shortcuts are a powerful new feature in iOS 12 that allow your app to expose its functionality to Siri. This enables Siri to suggest your shortcut at relevant times based on various context. Shortcuts can also be added to Siri to run with a voice phrase on iOS, HomePod and watchOS. Learn how to expose shortcuts in your app using NSUserActivity and discover the benefits of creating custom intents with SiriKit for a richer user experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/715o2fzpdzzzf5f0/715/715_hd_introducing_networkframework_a_modern_alternative_to_sockets.mp4?dl=1", "title": "Introducing Network.framework: A modern alternative to Sockets", "summary": "The new Network.framework API gives you direct access to the same high-performance user-space networking stack used by URLSession. If you're considering using Berkeley Sockets in your app or library, learn what better options are available to you."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/713u3ysohtlec95j3ir/713/713_hd_introducing_natural_language_framework.mp4?dl=1", "title": "Introducing Natural Language Framework", "summary": "Natural Language is a redesigned framework designed to provide high-performance, on-device APIs for fundamental NLP tasks across all Apple platforms. Through the deep integration of the framework with Core ML and Create ML, you now have the ability to train custom NLP models to perform many different inferences and leverage the power of NLP in your apps. Join us for this exciting session to learn all the details and to see it in action."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/212nan45edr4qp/212/212_hd_introducing_mapkit_js.mp4?dl=1", "title": "Introducing MapKit JS", "summary": "MapKit JS brings Apple Maps to your website. See how MapKit JS provides map rendering that is optimized for various browsers and devices, and supports native gestures such as pinch-to-zoom, two-finger rotate, and more. Learn how to add annotations and overlays, and how to use JavaScript interfaces to Apple Maps services such as Search and Directions to deliver an amazing map experience on your website."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/703r5lx362so6b/703/703_hd_introducing_create_ml.mp4?dl=1", "title": "Introducing Create ML", "summary": "Create ML is a new framework designed to help you easily build machine learning models using Swift and Xcode. Designed for Simplicity and Performance. Learn how you can build customized models from data that will enable new and powerful features in your apps using Create ML."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/215xraudwwyzg2lgu2l/215/215_hd_introducing_classkit.mp4?dl=1", "title": "Introducing ClassKit", "summary": "The new ClassKit framework lets you organize educational content in your app so that teachers can discover and assign specific activities and view students' progress in the new Schoolwork app. Learn how to adopt ClassKit to your content structure, declare assignable content, and share student progress on activities teachers assign in Schoolwork."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/802shgxe9sj19r/802/802_hd_intentional_design.mp4?dl=1", "title": "Intentional Design", "summary": "Great app experiences leap off the screen. They are dynamic, immersive, personal, and, above all else, the result of a strong and clear intent. Learn key techniques for being intentional with your design by choosing appropriate metaphors, making extreme choices, and making every interaction feel more authentic and natural."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/721w2b36lz4yno7f4/721/721_hd_implementing_autofill_credential_provider_extensions.mp4?dl=1", "title": "Implementing AutoFill Credential Provider Extensions", "summary": "Password AutoFill delivers the ability to fill passwords seamlessly within iOS apps and Safari. Join us to learn how app developers who provide credential management can surface their credentials during sign-in within apps and on the web."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/203zyni18c4phf/203/203_hd_i_have_this_idea_for_an_app.mp4?dl=1", "title": "I Have This Idea For An App...", "summary": "Do you have an idea for an app that you think would be useful to others, but you don't know how to make it a reality? You're not alone! Lots of people are interested in app development, but they aren't sure how to turn their idea to code and then into a finished app. From first steps to Xcode, we'll explain the building blocks you need to turn your iOS app idea into reality."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/231yewsuorvvh0v47z/231/231_hd_homekit_deep_dive.mp4?dl=1", "title": "HomeKit Deep Dive", "summary": "Get a fresh look at the HomeKit APIs. Understand how Siri and the Apple Home App use Action Sets and Accessory Services & Characteristics to provide a great home automation experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/220f49ijgby0rma/220/220_hd_high_performance_auto_layout.mp4?dl=1", "title": "High Performance Auto Layout", "summary": "Get a glimpse inside to find out what happens when you add a constraint! Dive into the internals of Auto Layout to develop intuition for how your code affects what happens under the hood. Learn how to measure and refine your approach to Auto Layout and see how its improved performance in iOS 12 will speed up your app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/508g9tgxpjyfuwr1ap/508/508_hd_getting_and_using_a_mapkit_js_key.mp4?dl=1", "title": "Getting and Using a MapKit JS Key", "summary": "MapKit JS uses the JWT standard for ensuring a secure connection between your site and the MapKit JS services.  Learn how to create, protect, and use site-specific keys to ensure only your servers are accessing APIs linked to your domain."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/239oqke16leldnu3010/239/239_hd_designing_web_content_for_watchos.mp4?dl=1", "title": "Designing Web Content for watchOS", "summary": "watchOS 5 brings web content to Apple Watch by rendering rich HTML in Messages and Mail. Gain insights into how watchOS maintains compatibility with existing web content, and find out what you can do to optimize your web content for Apple Watch."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/806d34jrsj444iqhb/806/806_hd_designing_notifications.mp4?dl=1", "title": "Designing Notifications", "summary": "Thoughtfully designed notifications are a powerful way to communicate timely information to people that they will find valuable and useful. Learn how you can design notifications people want to receive by making them beautiful, helpful, actionable, and respectful of their valuable time and attention."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/803lpnlacvg2jsndx/803/803_hd_designing_fluid_interfaces.mp4?dl=1", "title": "Designing Fluid Interfaces", "summary": "Discover the techniques used to create the fluid gestural interface of iPhone X. Learn how to design with gestures and motion that feel intuitive and natural, making your app a delight to use."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/201bam0z9pcq7bs5km/201/201_hd_creating_apps_for_a_global_audience.mp4?dl=1", "title": "Creating Apps for a Global Audience", "summary": "Common assumptions can break when your app is used by a global audience. Learn about the many aspects of creating apps for different regions and languages. Understand how to use fonts and typography, layout techniques, and support text input so your app shines in all languages."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/213ivbgp77y4z4/213/213_hd_carplay_audio_and_navigation_apps.mp4?dl=1", "title": "CarPlay Audio and Navigation Apps", "summary": "Learn how to update your audio or navigation app to support CarPlay. Apps in CarPlay are optimized for use in the car, and automatically adapt to available vehicle screens and input controls. Audio apps can deliver music, news, podcasts, and more. With the new CarPlay framework, Navigation apps can provide detailed maps, destination search, turn-by-turn guidance, and user notifications."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/214w2w1racklnrc0l/214/214_hd_building_for_voice_with_siri_shortcuts.mp4?dl=1", "title": "Building for Voice with Siri Shortcuts", "summary": "Siri Shortcuts are a great way to help people execute actions or get information from your app, but shortcuts can be made even more powerful by adding them to Siri to be used with a simple phrase. Learn how you can now customize responses from Siri and add custom UI to make a great shortcuts experience across iOS, watchOS and HomePod. See how to allow users to add and manage shortcuts from right within your app and learn best practices to make shortcut suggestions that can be exposed through Settings."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/718twnl0ca4qp1rrm7/718/718_hd_better_apps_through_better_privacy.mp4?dl=1", "title": "Better Apps through Better Privacy", "summary": "At Apple, we believe in building products with both great features and great privacy. Learn how to apply privacy engineering techniques to your apps so you can build trust with users to unlock better experiences and engagement.  And find out how new privacy features can benefit you and your users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/204jfuuku83cex/204/204_hd_automatic_strong_passwords_and_security_code_autofill.mp4?dl=1", "title": "Automatic Strong Passwords and Security Code AutoFill", "summary": "Passwords and security codes are a modern necessity required for security and privacy. iOS 12 eases the tedious aspects of account setup and sign-in by automatically suggesting and using strong, unique passwords — even from within apps —  and by bringing one-time codes to the QuickType bar so users can fill them with one tap. Learn how to optimize your app to ensure that password, security code, and other AutoFill features provide a seamless way for your users to be more secure."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/809kx2o95wevp48/809/809_hd_apple_pencil_design_essentials.mp4?dl=1", "title": "Apple Pencil Design Essentials", "summary": "Make your apps even more powerful and expressive with Apple Pencil. Learn Apple Pencil design best practices such as correctly balancing touch and pencil interactions, fully harnessing Apple Pencil sensors, and creating more efficient and natural user flows."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/205tyzmd4sury4r/205/205_hd_advances_in_research_and_care_frameworks.mp4?dl=1", "title": "Advances in Research and Care Frameworks", "summary": "HealthKit, CoreMotion, and other iOS frameworks combined with the ResearchKit and CareKit open-source projects, provide a deep platform for the creation of game-changing apps for care teams, researchers, and the medical community. Discover new active tasks that leverage calibrated device data and how new CoreMotion APIs deliver insightful results capable of assisting diagnosis and improving care. Hear about updates and contributions from the open-source community and gain practical guidance you need to rapidly deliver your next research or care app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/218o6oial8c68yom/218/218_hd_advanced_dark_mode.mp4?dl=1", "title": "Advanced Dark Mode", "summary": "Step deeper into Dark Mode adoption in your macOS application. Learn about the powerful Cocoa technologies at the core of Dark Mode, and take a detailed look at the APIs and best practices for adapting to this beautiful new look."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/233uq0n4zauq0ili/233/233_hd_adding_delight_to_your_ios_app.mp4?dl=1", "title": "Adding Delight to your iOS App", "summary": "iOS contains powerful technologies you can use to make your app truly delightful. Learn how to take your app to the next level with easy-to-implement features such as Handoff and External Display support. Preserve that feeling of magic in your app with pro-tips that combine animations, gestures and layout, while keeping your scrolling smooth, and your code scalable. Dive into the anatomy of a launch to get your app responsive quickly, and learn some great debugging tricks from the pros!"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/706pjh63zj75v07w6/706/706_hd_accessing_health_records_with_healthkit.mp4?dl=1", "title": "Accessing Health Records with HealthKit", "summary": "HealthKit provides a consolidated repository for a variety of data including health records containing information such as lab results, immunizations, and medications downloaded directly from institutions. Discover new health records classes and types created to provide easy access to high-level record types without preventing access to the underlying raw data.  Learn new authorization techniques that allows your app to access health record data for analysis and presentation in a manner that respects your customer's privacy."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/225s90wcvt1fjg6b/225/225_hd_a_tour_of_uicollectionview.mp4?dl=1", "title": "A Tour of UICollectionView", "summary": "UICollectionView is a flexible, powerful tool to help you achieve great user experiences in your applications. Hear how you can leverage these rich APIs to rapidly move from initial design ideas to polished shipping applications. Topics range from getting started to advanced update animations and layouts."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/712rgcvlbuehdk/712/712_hd_a_guide_to_turi_create.mp4?dl=1", "title": "A Guide to Turi Create", "summary": "Turi Create is an open source toolset for creating Core ML models, for tasks such as image classification, object detection, style transfers, recommendations, and more. Learn how you can use Turi Create to build models for your apps."},
{"url": null, "title": "WWDC 2018 Keynote", "summary": "WWDC 2018 Keynote"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/102ly3xmvz1ssb1ill/102/102_hd_platforms_state_of_the_union.mp4?dl=1", "title": "Platforms State of the Union", "summary": "2018 Platforms State of the Union"},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/103zvtnsrnrijr/103/103_hd_apple_design_awards.mp4?dl=1", "title": "Apple Design Awards", "summary": "Join us for an unforgettable award ceremony celebrating developers and their outstanding work. The 2018 Apple Design Awards recognize state of the art iOS, macOS, watchOS, and tvOS apps that reflect excellence in design and innovation."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/416n2fmzz0fz88f/416/416_hd_ios_memory_deep_dive.mp4?dl=1", "title": "iOS Memory Deep Dive", "summary": "Discover how memory graphs can be used to get a close up look at what is contributing to an app's memory footprint. Understand the true memory cost of an image. Learn some tips and tricks for reducing the memory footprint of an app."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/228cp3feot1iav3gy4x/228/228_hd_whats_new_in_energy_debugging.mp4?dl=1", "title": "What’s New in Energy Debugging", "summary": "People expect long battery life on their mobile devices, and apps play a vital role in achieving that experience. Understand how app behavior affects battery consumption, and learn strategies to conserve energy while providing the best experience for your app. Find out how Xcode Energy Reports can help you tune your app to use the least amount of power possible."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/403r3eh2u29dfeml/403/403_hd_whats_new_in_testing.mp4?dl=1", "title": "What's New in Testing", "summary": "Hear about exciting improvements to code coverage, including how you can build your own automation on top of Xcode's coverage reports. Learn how to dramatically speed up the execution of your tests by leveraging distributed parallel testing, new in Xcode 10."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/401ieeclipzse3tz3fg/401/401_hd_whats_new_in_swift.mp4?dl=1", "title": "What's New in Swift", "summary": "Hear about the latest advancements in Swift, the safe, fast, and expressive language. Find out about improvements to build times, code size, and runtime performance. Learn how to take advantage of new features in your code that eliminate boilerplate, increase safety and security, and improve your overall development productivity."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/409t8zw7rumablsh/409/409_hd_whats_new_in_llvm.mp4?dl=1", "title": "What's New in LLVM", "summary": "The LLVM suite of compiler tools in Xcode 10 have new language features, improved diagnostics, and more powerful optimizations. Find out about improvements to ARC for Objective-C, keep up with the newest additions to C++, get an overview of new and improved diagnostics and static analyzer checks, and learn about how LLVM compiler technology is delivering faster build times and better runtime performance for your apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/414djzbkfdpkvf50/414/414_hd_understanding_crashes_and_crash_logs.mp4?dl=1", "title": "Understanding Crashes and Crash Logs", "summary": "Sudden app crashes are a source of bad user experience and app review rejections. Learn how crash logs can be analyzed, what information they contain and how to diagnose the causes of crashes, including hard-to-reproduce memory corruptions and multithreading issues."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/417j8ucs9p8w7seip/417/417_hd_testing_tips__tricks.mp4?dl=1", "title": "Testing Tips & Tricks", "summary": "Testing is an essential tool to consistently verify your code works correctly, but often your code has dependencies that are out of your control. Discover techniques for making hard-to-test code testable on Apple platforms using XCTest. Learn a variety of tips for writing higher-quality tests that run fast and require less maintenance."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/406z8wpyv2jdenet9rc/406/406_hd_swift_generics.mp4?dl=1", "title": "Swift Generics", "summary": "Generics are one of the most powerful features of Swift, enabling you to write flexible, reusable components while maintaining static type information. Learn about the design of Swift's generics, including how to generalize protocols, leverage protocol inheritance to express the varying capabilities of related types, build composable generic components with conditional conformances, and reason about the interaction between class inheritance and generics."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/418ernlc0c54xrb8sn/418/418_hd_source_control_workflows_in_xcode.mp4?dl=1", "title": "Source Control Workflows in Xcode", "summary": "Xcode integrates with GitHub, Bitbucket, and GitLab to help you manage your source code, back up your files, and collaborate with others. Find out how to easily see the changes in your project right in the source editor, and learn how to use Xcode for common source control workflows with Git. See how conflicts occur, how to resolve them, and how to avoid them before they even happen."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/811tcr2wk13t3uq/811/811_hd_presenting_design_work.mp4?dl=1", "title": "Presenting Design Work", "summary": "Ideas can live or die by their presentation. Learn indispensable and proven techniques for presenting your design work to better communicate your objectives and receive helpful, valuable and constructive feedback."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/407akll3nbwls9yn4qt/407/407_hd_practical_approaches_to_great_app_performance.mp4?dl=1", "title": "Practical Approaches to Great App Performance", "summary": "All apps benefit from a focus on performance and an increase in overall responsiveness. This information packed session gives you strategies for fixing performance problems using Instruments and other tools. Additionally, get practical advice based on experience in tuning Apple's own apps including Xcode and Photos on iOS."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/209pydirtfgavpnj/209/209_hd_whats_new_in_cocoa_for_macos.mp4?dl=1", "title": "What's New in Cocoa for macOS", "summary": "Gain insights into the latest in Cocoa frameworks for macOS. Hear about Dark Mode, control tinting, contextual workflows for Touch Bar and Finder, and other improvements in AppKit, Foundation, and related areas. Get an overview and guide to the sessions that we have this year covering advancements in Cocoa."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/229aa99vrkiplc/229/229_hd_using_collections_effectively.mp4?dl=1", "title": "Using Collections Effectively", "summary": "Every app uses collections! Go beyond the basics with specific tips on how best to use indices, slices, bridging, laziness, and reference types. Gain better understanding of when to use each collection for best performance."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/227r61xi77ucgjz6zm/227/227_hd_optimizing_app_assets.mp4?dl=1", "title": "Optimizing App Assets", "summary": "Learn how to use assets to bring visually compelling and data efficient artwork to your apps, leveraging new features in iOS 12. Gain insight into organizing, optimizing, and authoring artwork assets by using asset catalogs to their fullest. Learn techniques to better streamline workflows between designers and developers. Ensure better app delivery and a smaller footprint, maximizing target audiences of your app with full artwork asset fidelity."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/404cpduaxf6gola/404/404_hd_new_localization_workflows_in_xcode_10.mp4?dl=1", "title": "New Localization Workflows in Xcode 10", "summary": "The localization process in Xcode 10 has been updated to aid you through the lifecycle of exporting, importing, and testing localized content in your apps. See new functionality added in Xcode 10 and learn how the new localization catalog helps you build world-class, localized apps."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/609yyw42hw6wq6mte8p/609/609_hd_metal_for_accelerating_machine_learning.mp4?dl=1", "title": "Metal for Accelerating Machine Learning", "summary": "Metal Performance Shaders (MPS) includes a highly tuned library of machine learning primitives leveraging the tremendous power of the GPU. With iOS 12 and macOS Mojave, MPS adds capabilities to accelerate the computationally intensive task of training a neural network. Learn performance optimizations for inference, and understand the training process for both convolutional and recurrent neural networks (CNNs and RNNs)."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/226s1li4vc2mjvj4j/226/226_hd_voiceover_app_testing_beyond_the_visuals.mp4?dl=1", "title": "VoiceOver: App Testing Beyond The Visuals", "summary": "VoiceOver provides spoken descriptions and braille output of onscreen elements. Learn how to go beyond the visuals to identify VoiceOver and functional issues to help improve the experience for all users."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/232mj2p4q92uls5n/232/232_hd_getting_ready_for_business_chat.mp4?dl=1", "title": "Getting Ready for Business Chat", "summary": "Business Chat is a powerful way for organizations to connect with customers directly from within Messages. Whether you are a Customer Service Platform provider, a brand looking to integrate chat for customer communication, or a brand app developer looking to extend your iOS app to enhance Business Chat conversations, you'll receive concrete guidance and learn the baseline requirements necessary to ensure you are ready to go live."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/705u9699a9lzqsghf2c/705/705_hd_engineering_subscriptions.mp4?dl=1", "title": "Engineering Subscriptions", "summary": "Learn the best practices for architecting your subscription infrastructure using StoreKit and server-side logic. Find out about simple engineering techniques to keep your subscribers longer, and how to utilize new tools and APIs to give your subscribers the best experience."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/230bqynnqagiq4p8/230/230_hd_deliver_an_exceptional_accessibility_experience.mp4?dl=1", "title": "Deliver an Exceptional Accessibility Experience", "summary": "Go beyond the basics and create apps with an exceptional accessibility experience. Learn how to design elements that appear in your app for maximum clarity and accessibility. Discover how to enhance the way users interact with your app even when presenting custom views, or drawing complex UI."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/704n9oeu4famgn/704/704_hd_best_practices_and_whats_new_with_inapp_purchases.mp4?dl=1", "title": "Best Practices and What’s New with In-App Purchases", "summary": "Learn about the latest updates in StoreKit, including offering introductory pricing for subscriptions, requesting ratings and reviews, promoting your in-app purchases within the App Store, and developing in the sandbox environment. Dive deep into best practices for processing transactions and validating receipts."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/303ewlysk7t1l43/303/303_hd_automating_app_store_connect.mp4?dl=1", "title": "Automating App Store Connect", "summary": "The new App Store Connect API provides a familiar and highly readable REST API designed to facilitate the automation of many tasks you would typically perform through the Apple Developer website and the App Store Connect browser interfaces. Learn how this API allows you to manage your apps and testers for TestFlight, create code signing resources, download reports, and even manage your organization. See how this API leverages JWT authentication and a JSON payload for all transactions to make this new service easy to integrate with your existing automated workflows."},
{"url": "https://devstreaming-cdn.apple.com/videos/wwdc/2018/241fyqqiogmd6sv/241/241_hd_accessible_drag_and_drop.mp4?dl=1", "title": "Accessible Drag and Drop", "summary": "Drag and Drop is a powerful API that allows apps to share and communicate data. No matter how you decide to implement Drag and Drop, there's a way to make it work for people with accessibility needs. Learn the details as we dive into accessible Drag and Drop for iOS."}
]